<template>
</template>

<script>
export default {
	components: {}, // 자식 컴포넌트가 있을 경우에 여기에 적는다.
	name: 'name', // 자식 컴포넌트일 경우 컴포넌트의 이름을 지정한다.
	props: {}, // 자식 컴포넌트일 경우 부모에게서 받을 프롭스를 지정한다. 데이터 형식도 적어둔다.
  data() {
    return {};
  }, // 컴포넌트의 화면상에 드러나는 정보들을 데이터로 만들어둔다.
	computed: {}, // 가공되는 데이터들은 여기에 넣어서 사용하는 것이 좋다. 캐싱 때문이다.
  methods: {}, // 데이터가 사용되는 함수들은 이 안에 만들어서 사용한다. 데이터를 사용하지 않는다면 밖에다 만들어도 좋다.
	beforeCreate() {}, // 정보가 준비되기 직전
	created() {}, // 컴포넌트가 렌더링 되기 전, 정보를 준비하는 상태
	beforeMount() {}, // 렌더링 되기 직전
	mounted() {}, // 정보를 기반으로 컴포넌트가 렌더링 된 상태
	beforeUpdate() {}, // 리렌더링 되기 직전
	updated() {}, // 렌더링 된 상태에서 정보가 업데이트 되고 리렌더린 된 상태
	beforeDestroy() {}, // 컴포넌트가 사라지기 직전
	destroyed() {}, // 컴포넌트가 효과를 다 해 사라진 상태
	watch: {}, // 데이터로 사용하고 있는 값의 변화를 주시하다가 변하면 이 안의 코드가 자동적으로 실행되는데, 웬만해선 쓰지 않는 게 좋다.
};
</script>

<style>
</style>