function btnrace() {
    var race = [
        '휴미안', '엘피안', '다르크엘피안', '디엘피안', '우르키안',
        '듀아피안', '고블리안', '아스모디안', '고르고니안', '타이타니안',
        '디아볼리안', '엘리오시안', '오우간', '리아피안', '머메디안',
        '블라디안', '엘레멘티', '엔티안', '그렘리안', '오블리안',
        '불카니안', '드라고니안', '드라큘리안', '락토니안', '디모니안',
        '아스트리안', '엘리오스', '디아볼로스', '데미 셀레스티안',
        '셀레스티안', '아르탈른', '안드로이드', '사이보그', '언데드',
        '기어로비아', '고스티아', '이레귤러', '아크 아르탈른', '신룡',
        '마수', '마룡', '신수', '몬스터',
    ];
    // 레이스라는 이름으로 배열을 만든다.

    var racedice;
    racedice = race[Math.floor(Math.random()*race.length)];
    // 방금 변수로 지정한 배열에서 랜던감 값을 뽑아낸다.

    var btnresult = document.getElementById("btnresult");
    // 값을 출력할 div 태그를 변수로 지정한다.

    var btntext = '오늘의 종족은 <span class="color">' + racedice + "!</span>";
    // 랜덤으로 뽑아낸 값을 이용해 메시지를 작성한다.

    btnresult.innerHTML = btntext;
    // 메시지를 div 태그 안에 넣는다.
}

function btnrace2() {
    var race2 = [
        '거인', '고블린', '골렘', '귀신', '난쟁이',
        '네피림', '노움', '늑대인간', '다크엘프', '드래곤',
        '드워프', '로봇', '마인', '마족', '망령',
        '뱀파이어', '사신', '사이보그', '설인', '소인',
        '수인', '신', '신수', '악마', '안드로이드',

        '언데드', '엘프', '오크', '하프 오크', '외계인',
        '요정', '용인', '유령', '이종족', '인간',
        '인수', '인어/어인', '인조인간', '하플링', '임프',
        '인큐버스', '서큐버스', '와이번', '드레이크',
        '듀라한', '트롤', '천사', '타천사', '정령',

        '오우거', '하프 엘프', '요괴', '괴인', '마수',
        '괴수', '그렘린', '인형', '저승사자',
    ];

    var race2dice;
    race2dice = race2[Math.floor(Math.random()*race2.length)];
    var btnresult = document.getElementById("btnresult");
    var btntext = '오늘의 종족은 <span class="color">' + race2dice + "!</span>";
    btnresult.innerHTML = btntext;
}

function btnclass() {
    var btnclass = [
        '원소 마법사', '투사', '그림자 투사', '음악가', '사격수',
        '궁사', '도적', '신성 기사', '기사', '약초사',
        '갑옷장인(대장장이)', '정비사', '정화사', '사제', '암흑 마법사',
        '신성 마법사', '소환 마법사', '무기 상인', '요리사', '강령술사',
        '사령술사', '무투사(격투가)', '마법투사', '농부', '무법자',
        '수도승', '살인청부업자', '신관', '점술사', '정령 마법사',
        '이단심판관', '어부', '왕', '왕자', '공주',
        '여왕', '황제', '여제', '용사', '퇴마사',
        '장의사', '가수', '주술사', '마왕', '방패투사',
        '갑옷 상인', '약초 상인', '잡품 상인', '무기장인(대장장이)', '자연숭배가',

        '광투사', '야만투사', '정찰꾼', '해적', '산적',
        '현상금 사냥꾼', '교주', '(무기를 사용하는)투사', '예언가', '암살자',
        '암흑 기사', '인형술사', '건달', '병사', '노예',
        '집사', '영매사', '암상인', '사서', '촌장',
        '저격수', '장교', '의료사', '간호원', '신부(종교)',

        '사기꾼', '파계승', '학자', '마도학자', '음양사',
        '항해사', '선장', '요리사', '교사', '세계의 수호자',
        '수호자', '모험가', '해결사',
    ];

    var classdice;
    classdice = btnclass[Math.floor(Math.random()*btnclass.length)];
    var btnresult = document.getElementById("btnresult");
    var btntext = '오늘의 직업은 <span class="color">' + classdice + "!</span>";
    btnresult.innerHTML = btntext;
}

function btnclass2() {
    var btnclass2 = [
        '군주', '만화가', '소설가', '프로게이머', '프로그래머',
        '간호사', '갑옷장인', '검사', '검투가', '격투가',
        '공주', '공학자', '과학자', '광대', '괴도',
        '교사', '군인', '기사', '노예', '농부',
        '대장장이', '도끼병', '도둑', '도박꾼', '드래곤 슬레이어',
        '드루이드', '디자이너', '마녀', '마법사', '마법소녀',
        '마법소년', '마술사', '마왕', '마피아', '망자',
        '중장보병', '메이드', '무녀', '무법자', '문지기',
        '방랑자', '범죄자', '불사자', '빌런', '사냥꾼',
        '사제', '사형수', '살인마', '살인청부업자', '상인',

        '성기사', '성직자', '소환사', '승려', '신관',
        '신부', '암살자', '약초사', '약초장인', '어부',
        '여왕', '영매사', '영웅', '왕', '왕자',
        '요리사', '음유시인', '의사', '이단심판관', '인형술사',
        '장교', '장군', '저격수', '전사', '점술사',
        '정령술사', '정복자', '정찰자', '족장', '주술사',
        '지휘관', '천민', '초능력자', '거너', '퇴마사',
        '파계승', '피난민', '학생', '해적', '현상금 사냥꾼',
        '궁병', '회사원', '히어로', '용사', '혁명가',
        '바운티 헌터', '심리학자', '최면술사', '연금술사', '항해사',

        '도선사', '정원사', '보모', '암상인', '기술자',
        '재봉사', '사육사', '은행지기', '사서', '촌장',
        '시장', '서포터', '길드 안내원', '해부학자', '백수',
        '수호자', '엑소시스트', '전령', '닌자', '떠돌이',
        '부랑자', '사령술사', '원소술사', '킥복서', '음양사',

        '카발리어', '창기병', '바바리안', '광전사', '석국병',
        '현자', '흑마법사', '흑기사', '마법사', '궁사',
        '포병', '보병', '스트리머', '건달', '깡패',
        '모험가', '해결사', '역병의사', '매드 사이언티스트',
    ];

    var class2dice;
    class2dice = btnclass2[Math.floor(Math.random()*btnclass2.length)];
    var btnresult = document.getElementById("btnresult");
    var btntext = '오늘의 직업은 <span class="color">' + class2dice + "!</span>";
    btnresult.innerHTML = btntext;
}

function btngender() {
    var btngender = [
        '남성', '여성', '보이쉬한 여성', '걸리쉬한 남성', '자웅동체',
        '무성',
    ];

    var genderdice;
    genderdice = btngender[Math.floor(Math.random()*btngender.length)];
    var btnresult = document.getElementById("btnresult");
    var btntext = '오늘의 성별은 <span class="color">' + genderdice + "!</span>";
    btnresult.innerHTML = btntext;
}

function btnbodytype() {
    var btnbodytype =[
        '가슴이 없는(여캐)', '가슴이 작은(여캐)', '가슴이 큰(여캐)', '각진 얼굴인', '거유(여캐 가슴크기)',
        '건장한', '광대뼈가 두드러진 얼굴인', '근육이 과하게 많은', '근육이 많은', '글래머러스한(여캐)',
        '길쭉한 얼굴인', '날씬한', '동그란 얼굴인', '뚱뚱한', '마른', '말라 비틀어진',
        '머리가 작은', '머리가 큰', '몸매가 에스라인인(여캐)', '무유(여캐 가슴크기)', '미유(여캐 가슴크기)',
        '뱃살이 나온', '보통', '브이라인 얼굴인', '빈유(여캐 가슴크기)', '상체가 긴',
        '약간 근육이 있는', '육감적인', '짧막한 얼굴인', '초유(여캐 가슴크기)', '통통한',
        '팔이 긴', '평유(여캐 가슴크기)', '폭유(여캐 가슴크기)', '하체가 긴', '한쪽 다리가 짧은',
        '한쪽 팔이 짧은', '허약한', '짧은 꼬리가 달린', '긴 꼬리가 달린', '귀가 긴',
        '2등신', '3등신', '4등신', '5등신', '6등신',
        '7등신', '8등신', '9등신',
    ];

    var bodytypedice;
    bodytypedice = btnbodytype[Math.floor(Math.random()*btnbodytype.length)];
    var btnresult = document.getElementById("btnresult");
    var btntext = '오늘의 체형은 <span class="color">' + bodytypedice + " 체형!</span>";
    btnresult.innerHTML = btntext;
}

function btnattribute() {
    var btnattribute = [
        '어둠', '빛', '바람', '불', '물',
        '전기', '공기', '생명', '죽음', '땅',
        '모래', '바위', '피', '마그마', '얼음',
        '흙', '그림자', '맹독', '식물', '나무',
        '시간', '공간', '금속', '영혼', '공허',
        '한기', '열기', '자석', '폭발', '비행',
        '레이저', '(뭔가를)흡수', '(뭔가를)방출', '방사능', '수정',
        '유리', '섬유', '장력', '먼지', '염력',
        '석유', '플라스틱', '고무', '실', '산성',
        '부식', '소리', '진공', '굴절', '왜곡',
        
        '반사', '중력', '연소', '가스', '향기',
        '환각', '환상', '환청', '플라즈마', '암흑물질',
        '용암', '음파', '힘', '속도', '체력',
        '청각', '시각', '후각', '창조', '파괴',
        '심안', '날씨', '폭풍우', '뼈', '유전자',
        
        '기억', '정신',
    ];

    var attributedice;
    attributedice = btnattribute[Math.floor(Math.random()*btnattribute.length)];
    var btnresult = document.getElementById("btnresult");
    var btntext = '오늘의 속성은 <span class="color">' + attributedice + "!</span>";
    btnresult.innerHTML = btntext;
}

function btnweapon() {
    var btnweapon = [
        '식칼', '대검', '표창', '건틀릿', '창',
        '특대검', '단검', '곡검', '투핸드 소드', '대곡검',
        '특대곡검', '활', '대궁', '단궁', '채찍',
        '석궁', '자동 쇠뇌', '낫', '복합궁', '투척용 도끼',
        '투창', '나무 각목', '작살', '대형 단도', '소형 단도',
        '맥가이버 나이프', '올가미', '손쇠뇌', '수리검', '슬링',
        '막대 슬링', '볼라', '너클', '주먹',
        '죽도', '목검', '일본도', '기병도', '곤봉',
        '나기나타', '언월도', '쿠크리 나이프', '쌍절곤',
        '삼절곤', '장창', '사모(창)', '쌍검', '부월(도끼)',

        '경찰봉', '과도', '레이피어', '철퇴', '나이프',
        '회칼', '도끼', '양날도끼', '전투도끼', '할버드',
        '폴액스', '토마호크', '톤파', '워해머', '메이스',
        '모닝스타', '월도', '삼지창', '협도', '월극',
        '스피어', '랜스', '글레이브', '투석기', '발리스타',
        '새총', '클로', '도리깨', '커틀러스', '사브르',
        '브로드 소드', '수류탄', '화염병', '섬광탄', '연막탄',
        '데린저', '피스톨', '리볼버', '펌프 샷건', '더블 배럴 샷건',
        '머스켓', '돌격 소총', '저격 소총', '기관총', '기관단총',
        '화염방사기', '미사일', '로켓 발사기', '박격포', '곡사포',

        '평사포', '중기관총', '유탄', '가우스 라이플', '레이저 건',
        '레이저 라이플', '광선검', '빔 라이플', '빔 캐논', '레이저 캐논',
        '단분자 커터', '꼭두각시 인형', '은사 (와이어)', '전기톱', '몽키 스패너',
        '야구 방망이', '곡괭이', '무술', '다이너마이트', '폭탄',
        '스태프', '완드'
    ];

    var weapondice;
    weapondice = btnweapon[Math.floor(Math.random()*btnweapon.length)];
    var btnresult = document.getElementById("btnresult");
    var btntext = '오늘의 무기는 <span class="color">' + weapondice + "!</span>";
    btnresult.innerHTML = btntext;
}

function btnshield() {
    var btnshield = [
        '강철 방패', '버클러(주먹으로 쥐는 원형방패)', '방탄 방패', '라운드 실드', '아스피스',
        '스쿠툼', '파르마', '케트라투스', '연미패', '등패',
        '카이트 실드', '히터 실드', '타지(팔에 걸쳐서 사용하는 원형방패)', '파비스', '맨틀리트',
        '타워 실드', '에너지 방패', '원소 방패'
    ];

    var shielddice;
    shielddice = btnshield[Math.floor(Math.random()*btnshield.length)];

    switch (shielddice) {
        case '버클러(주먹으로 쥐는 원형방패)':
            var shieldimage = 'https://i.pinimg.com/564x/77/8b/d4/778bd41647a59bdeb7becc5fffcac26d.jpg';
            break;
        case '라운드 실드':
            var shieldimage = 'https://i.pinimg.com/564x/0a/6e/00/0a6e003364240a262f8ef7231a36b967.jpg';
            break;
        case '파르마':
            var shieldimage = 'https://i.pinimg.com/564x/a7/b0/86/a7b086f0114cfbc3b252120e12089009.jpg';
            break;
        case '타지(팔에 걸쳐서 사용하는 원형방패)':
            var shieldimage = 'https://i.pinimg.com/564x/e9/05/37/e90537f4a6f51ce4034fd7e90b6555ff.jpg';
            break;
        case '방탄 방패':
            var shieldimage = 'https://s-media-cache-ak0.pinimg.com/originals/f2/e0/ab/f2e0abd659035d4b3c188972c43b5c0b.jpg';
            break;
        case '아스피스':
            var shieldimage = 'http://isword.co.kr/admin/goods/files/IS01110004(3).jpeg';
            break;
        case '스쿠툼':
            var shieldimage = 'https://img1.daumcdn.net/thumb/R720x0.q80/?scode=mtistory2&fname=http%3A%2F%2Fcfile24.uf.tistory.com%2Fimage%2F2741CA3B57DED02A010F70';
            break;
        case '케트라투스':
            var shieldimage = 'https://i.pinimg.com/236x/2f/94/fe/2f94fe441bb0b494d5c04eef3f00371b--roman-shield-roman-empire.jpg';
            break;
        case '연미패':
            var shieldimage = 'https://encrypted-tbn0.gstatic.com/images?q=tbn%3AANd9GcQHlmu5W2593ul_j0Wo6tjH4qFg4qVmAOAN4FQ4J4zVoaWPvB6U&usqp=CAU';
            break;
        case '카이트 실드':
            var shieldimage = 'https://lh3.googleusercontent.com/proxy/xO7VEGKcHJQLRgsvqiyjbOwEQ3EarBTZ6c4zvSC-iMgS-9sc3j370jiAuvv1QDh8MGteazFeS1sm92phdUbLGq6G-hExw3dxDSYsuxSUrjq9lkgJ5PJGIWlbVk3LIH7f_fDaftxsQwc6A6McVfjw';
            break;
        case '등패':
            var shieldimage = 'http://pds24.egloos.com/pds/201110/01/83/d0033083_4e871c364340c.jpg';
            break;
        case '히터 실드':
            var shieldimage = 'http://yeoldegaffers.com/sbg/shield_p1.jpg';
            break;
        case '파비스':
            var shieldimage = 'https://w.namu.la/s/5f3701edc72a6266bd498b77413bec240e885464832d9706ee4c6b379a57d5be89175b427874f9f2f88deba03e1eec238c5bda5a0cfe1940723dc6b4e473f1fd1e1b1942accba70cb5a96cab1c841d2388d886883021fb5735d70236f5fd45d3';
            break;
        case '맨틀리트':
            var shieldimage = 'https://ww.namu.la/s/9eb889311bf78716afba07ab5604d166fa448f555a358a24122b3aee4e7c5a166f56c81118f517e6a57b284bd5c615136dd239cfed883b1bb4052531dac529db24b26d01d0d0e869d4839bf105220d03163d17afd1a53c1dc5ad7d129fbcb639';
            break;
        default:
            var shieldimage = '';
    }

    var btnresult = document.getElementById("btnresult");
    var btntext = `
        오늘의 방패는 <span class="color">${shielddice}!</span>
        <img style="width: 200px; display: block; margin: 10px auto;" src="${shieldimage}" alt="이미지가 없습니다.">
    `;
    btnresult.innerHTML = btntext;
}

function btnclothes() {
    var btnclothes = [
        '가죽 갑옷', '가터벨트', '갑주무장(동양/일본)', '갑주무장(동양/중국)', '갑주무장(동양/한국)',
        '갑주무장(서양)', '갓', '강철 갑옷', '고풍스러운 갑주', '고풍스러운 의상',
        '기모노', '남바위(모자)', '드레스', '로코코스타일 머리장식', '록커룩',
        '마린룩', '마이크로비키니', '메이드 머리밴드', '메일 갑옷', '모노클',
        '모던스타일 머리장식', '무도회 가면', '미늘 갑옷', '밀리터리룩', '바니걸 슈트',
        '방화복', '버프 코트', '부츠', '블라우스', '비키니',
        '사제복', '속옷/브래지어', '속옷/팬티(남성)', '속옷/팬티(여성)', '스쿨룩',
        '앞치마', '애니멀룩', '에스닉 룩', '오프숄더 의상', '오피스룩',
        '우주복', '원피스', '웨딩 드레스', '유건(모자)', '전신수영복',
        '전통복식(동)', '전통복식(동양/일본)', '전통복식(동양/중국)', '전통복식(서양)', '전통복식(아라비아권)',
        
        '전통복식(한국)', '정장', '족두리(머리 장식)', '중절모', '차이나드레스',
        '천 갑옷', '청동 갑옷', '치파오', '턱시도', '털 갑옷',
        '풀 플레이트 갑옷', '하우스메이드복', '하이힐', '한복', '개량 한복',
        '히피룩', '타지(이슬람계 챙없는 모자)', '구두', '가디건', '아쿠아슈즈',
        '샌들', '등산화', '전투화', '오버니삭스', '니삭스',
        '숏 케이프(망토)', '롱 케이프(망토)', '베일(얼굴장식)', '털모자', '캡 모자',
        '모자', '숄(의류 장식)', '란제리', '헤어밴드', '망사 스타킹',
        '와이셔츠', '티셔츠', '셔츠', '점퍼', '가죽 점퍼',
        '세일러복', '코르셋(속옷)', '조끼', '폴로셔츠', '민소매셔츠',
        '후드티', '스웨터', '라운드티', '브이넥 원피스', '브이넥 티셔츠',
        
        '브이넥 블라우스', '청셔츠', '체크셔츠', '잔체크셔츠', '슬랙스(바지)',
        '숏팬츠', '버뮤다팬츠', '청바지', '스트레이트 스커트', '랩 스커트',
        '호블 스커트', '트임 스커트', '요크 스커트', '고어드 스커트', 'A라인 스커트',
        '롱 원피스', '민소매 원피스', '뷔스티에 드레스', '기모노 드레스', '엠파이어 드레스',
        '슬립 원피스', '뷔스티에 원피스', '셔츠 원피스', '루즈삭스', '부르마',
        '트렁크스(속옷)', '가쿠란', '구속복', '각반', '산타복',
        '속바지', '수의', '스키니진', '반바지', '레깅스',
        '롱패딩', '롱스커트', '미니스커트', '라이딩 재킷', '래글런 티셔츠',
        '크롭티셔츠', '헨리넥 티셔츠', '반하이넥 티셔츠', '시스루 블라우스', '카라넥 티셔츠',
        '터틀넥 티셔츠', '레이스 블라우스', '프릴 블라우스', '유카타(기모노 일종)', '마과(중국 전통의상)',

        '아오자이(베트남 전통의상)', '디른들(독일 전통의상/여성)', '사라판(러시아 전통의상/여성)', '킬트(스코틀랜드 전통의상)', '터번(이슬람/아랍/남성)',
        '히잡(이슬람/아랍/여성)', '후리소데(일본 전통의상)', '토메소데(일본 전통의상)', '레오타드', '관복',
        '하쿠란(하얀 가쿠란)', '래쉬가드', '로우레그(속옷)', '하이레그(속옷)', '슬링샷(수영복)',
        '모노키니(수영복)', '수도복', '우의', '베일(얼굴장식)', '갸루 패션',
        '라이더 패션', '로리타 패션', '고스로리', '히메로리', '고스 룩',
        '메탈 룩', '모드 룩', '펑크 룩', '그런지 패션', '페어리 패션',
        '시스루 룩', '빈티지 패션', '프레피 룩', '바디 컨셔스 룩', '스트리트 패션',
        '이모 패션', '오피스 룩', '클리비지룩', '레기 룩', '롱패딩',
        '멜빵', '멜빵 바지', '멜빵 치마', '페도라', '헬멧',
        '볼러(모자)', '테일 코트', '프록 코트', '니트', '베스트(조끼)',

        '폰초(망토)', '블레이저(재킷)', '야상', '파카', '가운',
        '바람 막이', '피 코트', '트렌치 코트', '튜브 탑', '하이 삭스',
        '사이 하이 삭스', '돌핀팬츠', '치노(바지)', '타이츠(스타킹)', '버선',
        '옆트임(스타일)', '치마바지', '하이웨이스트(긴 바지)', '스패츠(바지)',
        '투명 스타킹', '보디 스타킹', '팬티 스타킹', '내복', '가슴붕대',

        '드로어즈', '가터 링', '뷔스티에(속옷)', '반팔런닝', '민소매런닝',
        '브라탑(속옷)', '줄무늬 팬티', '사각팬티', '브리프(속옷)', 'T프런트(속옷)',
        '갈라팬티', '작스트랩(속옷)', 'T팬티(속옷)', 'C스트링(속옷)', '단화'
    ];

    var clothesdice;
    clothesdice = btnclothes[Math.floor(Math.random()*btnclothes.length)];
    var btnresult = document.getElementById("btnresult");
    var btntext = '오늘의 의상은 <span class="color">' + clothesdice + "!</span>";
    btnresult.innerHTML = btntext;
}

function btnrandom() {
    var btnrandom = [
        '가루', '목욕 가운', '영혼', '악당', '가죽 벨트',
        '가면', '가발(색상 자유)', '가방', '가슴붕대', '가시',
        '가죽', '가죽 장갑', '각력이 센', '각목', '갓',
        '거울', '야구 방망이', '계산기', '계약서', '고글',
        '고아', '고양이 귀 머리띠', '고통', '공 (Ball)', '공감각',
        '공구', '공구/곡괭이', '공구/너트(나사)', '공구/니퍼', '공구/드릴',
        '공구/망치', '공구/볼트(나사)', '공구/삽', '공구/송곳', '공구/스크류(나사)',
        '공구/스패너', '공구/오함마', '공구/전기톱', '공구/톱', '공구/펜치',
        '공구/플라이어', '공기', '공기총', '과거의 망령', '과일',
        
        '광물/백금', '광물/순금', '광물/은', '광물/황금', '광선',
        '광물/구리', '광속', '교복', '구름', '군복',
        '귀가 들리지 않는', '귀걸이', '귀도리', '귀마개',
        '그림자', '근력이 센', '글러브', '금속', '기갑의',
        '기모노', '기상/눈', '기상/비', '기상/우박', '기적',
        '깃털', '깨끗한', '꼬리', '꽃', '나무',
        '나뭇잎', '나비넥타이', '나이프(미술용)', '나침반', '낙하산',
        '날개', '낡은', '낡은 의상', '낡은 칼', '내복',
        '넥타이', '노안', '노출증', '노트북', '농구공',
        '농기구', '니트양말', '다중인격', '다트', '단단한',

        '단신', '단안경', '담배', '담뱃대', '대걸레',
        '더러운', '덫', '데스노트', '데일리', '도감',
        '도복', '독약', '돋보기', '동성애자', '동안',
        '동정', '두개골', '등산 배낭', '디젤펑크', '떡',
        '라켓', '랜턴', '램프', '렌즈', '로리콤',
        '로브', '로켓 추진기', '로켓(목걸이)', '마력이 깃든', '마마콤',
        '마법서', '마석', '마술', '마스크 (복면)', '마약',
        '막대기', '만년필', '망토', '맹독',
        '머리끈', '머리띠', '머리핀', '머플러', '메가폰',
        '메신저백', '명부', '목걸이', '목도리', '목줄',
        
        '못생긴', '공구/몽키 스패너', '물총', '물풍선', '미다스의 손',
        '무술', '무테안경', '무표정', '문신', '물약',
        '미로', '미망인', '바가지', '바구니', '바리게이트',
        '바이저 마스크', '바퀴', '반무테안경', '반지',
        '발광', '발라클라바(안면마스크)', '발목양말', '발찌', '발차기',
        '발토시', '발톱', '밧줄', '방독면', '방사능',
        '버선', '버킷리스트', '범재', '벙어리 장갑', '벨트',
        '변태', '병약한', '병풍', '보석', '보석/가넷',
        '보석/다이아몬드', '보석/라피스라즐리', '보석/루비', '보석/사파이어', '보석/스타 사파이어',
        '보석/아쿠아마린', '보석/앰버', '보석/오닉스', '보석/오팔', '보석/옥',

        '보석/진주', '보석/카방클', '보석/크리스탈', '보석/토파즈', '보석/펄',
        '보석/흑요석', '복수심', '부싯돌', '부적', '부채',
        '부케', '부활', '부활석', '불꽃', '붓',
        '붕대', '브로치', '비녀', '비늘', '비니',
        '비상', '비수', '빛', '빠른', '빵',
        '뼈', '뿌리', '뿔', '뿔테안경', '사이버펑크',
        '사이코패스', '사탕', '산소통', '상처', '새싹',
        '새장', '색소', '색안경', '생크림', '샤프',
        '샤프심', '서류가방', '선글라스', '성별역전(TS)', '성소수자',
        '성수', '소시오패스', '소환', '손목시계',

        '손톱', '쇠구슬', '쇼타콤', '수면양말', '수염',
        '술', '스냅백', '스마트폰', '스카프', '스팀펑크',
        '스프레이', '스피드 스터', '스피커', '슬픔', '시약',
        '식기/나무 숟가락', '식기/나무 젓가락', '식기/나무 포크', '식기/쇠 숟가락', '식기/쇠 젓가락',
        '식기/쇠 포크', '식기/플라스틱 숟가락', '식기/플라스틱 젓가락', '식기/플라스틱 포크', '식물',
        '시체', '식물인간', '신성력', '신호탄', '신화',
        '실내화', '실크 해트', '실험도구', '심장', '십자가',
        '씨앗', '아령', '아름다운', '아름다운 미소', '악력이 센',
        '악마 뿔 머리띠', '악마의 날개', '악장', '안경', '알람시계',
        '알몸', '알비노 (백색증)', '암석', '앞이 보이지 않는', '야구공',

        '야구방망이', '얀데레', '양말', '양산', '양성애자',
        '얼음', '에코백', '연필', '염동력', '염주',
        '예지력', '오로라', '오존', '오토바이', '오페라 글러브',
        '오피스룩', '와인', '완력이 센', '왕관(동양)', '왕관(서양)',
        '외톨이', '요리', '욕데레', '우산', '운동복',
        '운동화', '원반', '은밀한', '음속', '의수',
        '의안', '의족', '이끼', '이빠진 무기', '이어폰',
        '인공심장', '인공지능', '일회용품', '자석', '자연',
        '자폭', '잘생긴', '잠옷', '장기/눈알', '장신',
        '재생력', '잭 오 랜턴', '저울', '전자공학', '전자기기',

        '전자기파', '제 3의 눈', '젤리', '종이', '죄수복',
        '주사위', '주술', '중력', '지뢰', '지우개',
        '지팡이', '채소', '책', '책가방', '처녀',
        '천리안', '천사 링 머리띠', '천사의 날개', '천재', '철가방',
        '철조망', '철테안경', '체크무늬', '초감각(감지 능력)', '초롱',
        '초커', '촛불', '총기', '총알', '축구공',
        '츄리닝', '츤데레', '치마바니', '칠죄종', '카드',
        '카리스마', '칼날', '캐리어', '캐멀백', '캔트지(종이)',
        '컴퓨터', '케이크', '쿠키', '큐브', '키메라',
        '탄알집', '탈리스만', '탈옥', '탈주', '태엽',

        '털복숭이', '털양말', '투포환', '트랜스젠더', '파괴',
        '파레트', '파장', '파파콤', '팔랑귀', '팔찌',
        '팔토시', '폭탄', '풍선',
        '페인트', '페인트탄', '펜', '펜던트', '폭발물',
        '프리즘', '피', '피어싱', '합금/강철', '합금/아말감',
        '합금/청동', '합금/티타늄', '항공모함', '해골', '해독제',
        '핸드백', '행운', '향초', '허수아비', '헤드셋',
        '헤드폰', '헤어브릿지', '헬멧', '호리병', '호박',
        '화관', '화장품', '환자복', '후라이팬', '흉터',
        '희망', '히메로리', 'CD', 'EMP', '유틸리티 벨트',

        '원한', '미련', '애착', '짝사랑', '외사랑',
        '전기', '바람', '화산', '어둠', '폭발',
        '희생', '아포칼립스', '포스트 아포칼립스', '엑소시즘', '초능력',
        '초상능력', '마법', '마력', '집착', '계승자',
        '멸망', '구원', '혈흔', '지문', '꿰맨 흔적',
        '도벽', '수술자국', '수술', '느와르', '잠입',
        '암살', '이중인격', '강박증', '결벽증', '분노조절장애',
        '다혈질', '꽃/장미', '도술', '소환술', '살인무술',
        '권법', '태극권', '검도', '무에타이', '복싱',
        '킥복싱', '태권도', '공수도', '유도', '다른 차원',

        '다른 세계', '꽃/튤립', '파워드 슈트', '에너지 아머', '강화 외골격',
        '기계 슈트', '수건', '쉽게 현혹되는', '남을 현혹하는', '매혹적인',
        '사랑스러운', '귀여운', '예쁜', '밝은 기운을 주는', '우울함이 느껴지는',
        '패기가 넘치는', '위압적인', '엄격해 보이는', '흉측한', '괴상한',
        '신비로운', '두려운', '무서운', '겁에 질려 있는', '혈안이 되어 있는',
        '태블릿 PC', '두려움이 없는', '젖은', '희열에 젖어 있는', '기뻐하는',
        '즐거워하는', '끔찍한', '기괴한', '완장', '동전',
        '트럼프', '속임수', '마그마', '용암', '화염',
        '불', '물', '눈 결정', '돌', '돌덩이',
        '바위', '암석/현무암', '암석/화강암', '꽃잎', '이파리',

        '창조', '섬광', '길잡이', '바이러스', '백신',
        '세포', '면역', '광신도', '신앙', '종교',
        '동물', '의인화', '살인', '살생', '살해',
        '살인자', '곤충', '세계', '고양이(동물)', '강아지(동물)',
        '개(동물)', '소(동물)', '산양(동물)', '사냥(동물)', '코끼리(동물)',
        '코뿔소(동물)', '기린(동물)', '사자(동물)', '호랑이(동물)', '늑대(동물)',
        '여우(동물)', '공작(동물)', '독수리(동물)', '기러기(동물)', '갈매기(동물)',
        '매(동물)', '닭(동물)', '너구리(동물)', '핵전쟁', '핵미사일',
        '전략무기', '핵', '핵폭탄', '파멸', '멸종',
        '멸족', '재시작', '환생', '괴물', '몬스터',

        '살쾡이(동물)','생쥐(동물)', '악어(동물)', '인형', '저승사자',
        '스켈레톤', '미라', '강시', '좀비', '잔인한',
        '네크로맨서', '망자', '불사자', '잔혹한', '고대인',
        '고대종족', '고대의', '고대', '태고의', '태초의',
        '태초', '시간', '암거래', '암흑',
        '칠흑', '공간', '시간여행', '타임머신', '시간이동',
        '공간이동', '텔레포트', '미래', '과거',
        '현재', '상상', '초원', '고원', '평원',
        '과수원', '식인', '식인종', '꿈', '수면',
        '마취', '마취탄', '마취총', '화장', '눈물',

        '금은보화', '보물지도', '보물', '유적지', '금단의 구역',
        '제단', '제물', '희생양', '살의', '증오',
        '희열', '족쇄', '기쁨', '분노', '즐거움',
        '공포', '사랑', '혐오', '욕망', '수치심',
        '질투', '죄책감', '승부욕', '악의 조직', '비밀 결사',
        '자경단', '클론', '현자의 돌', '혈석', '소환석',
        '마법석', '천상계', '천국', '지옥', '마계',
        '뜨거운', '차가운', '이세계', '저승', '성불',
        '잎사귀', '잎', '왕권', '도그 태그 (군번줄)', '따분한',
        '심심한', '안대', '독극물', '독성물질', '발암물질',

        '핵융합', '번개', '자기장', '투명', '전류',
        '지진', '해일', '쓰나미', '재앙', '악기',
        '리본 장식', '도끼빗', '빗', '꼬리빗', '빗자루',
        '쓰레기통', '보물상자', '나무상자', '지도', '마도서',
        '죽음', '삶', '생명', '소멸', '수갑',
        '쇠사슬', '사슬', '석양', '우주', '천체/달',
        '천체/태양', '천체/항성', '천체/행성', '천체/유성', '천체/혜성',
        '천체/운석', '천체/태양계', '천체/수성', '천체/금성', '천체/지구', 
        '천체/화성', '천체/목성', '천체/토성', '천체/천왕성', '천체/해왕성', 
        '천체/명왕성', '천체/항성계', '천체/은하', '천체/초은하단', '천체/블랙홀',
        
        '천체/화이트홀', '천체/웜홀', '역병의사', '스승', '제자',
        '불행', '비극', '희극', '코즈믹 호러', '크툴루 신화',
        '암석/섬록암', '암석/반려암', '암석/감람암', '암석/휘록암', '암석/섬록 반암',
        '암석/석영 반암', '암석/유문암', '암석/안산암', '암석/흑요석', '암석/이암',
        '암석/엽암', '암석/사암', '암석/역암', '암석/석회암', '암석/응회암',

        '암석/석탄', '석유', '우유', '고대의 문명', '쿨데레',
        '메가데레', '보코데레', '다루데레', '빈데레', '위선자',
        '위악자', 
    ];

    var randomdice;
    randomdice = btnrandom[Math.floor(Math.random()*btnrandom.length)];
    randomdice2 = btnrandom[Math.floor(Math.random()*btnrandom.length)];
    randomdice3 = btnrandom[Math.floor(Math.random()*btnrandom.length)];
    randomdice4 = btnrandom[Math.floor(Math.random()*btnrandom.length)];
    randomdice5 = btnrandom[Math.floor(Math.random()*btnrandom.length)];
    randomdice6 = btnrandom[Math.floor(Math.random()*btnrandom.length)];
    var btnresult = document.getElementById("btnresult");
    var btntext = `
        오늘의 키워드는... 이거다!
        <div class="wordbox color">
            <p>${randomdice}!</p>
            <p style="color: #333333; margin: 20px 0px; font-size: 18pt;">보너스</p>
            <p style="font-size: 18pt;">${randomdice2}!</p>
            <p style="font-size: 18pt;">${randomdice3}!</p>
            <p style="font-size: 18pt;">${randomdice4}!</p>
            <p style="font-size: 18pt;">${randomdice5}!</p>
            <p style="font-size: 18pt;">${randomdice6}!</p>
        </div>
    `;
    btnresult.innerHTML = btntext;
}

function btnAlignment() {
    var btnAlignment = [
        '질서 선', '질서 중립', '질서 악', '혼돈 선', '혼돈 중립',
        '혼돈 악', '중립 선', '중립 악', '완전한 중립'
    ];

    var Alignmentdice;
    Alignmentdice = btnAlignment[Math.floor(Math.random()*btnAlignment.length)];
    var btnresult = document.getElementById("btnresult");
    var btntext = '오늘의 성향은 <span class="color">' + Alignmentdice + "!</span>";
    btnresult.innerHTML = btntext;
}

function btnhair() {
    var btnhair = [
        '비현실적 머리', '긴생머리', '롤머리', '스트레이트 헤어', '빗자루 머리',
        '숏컷', '미디엄헤어', '다이도 플립', '곱슬머리', '스킨헤드',
        '투블럭', '모히칸', '웨이브 헤어', '샤기컷', '댄디컷',
        '울프컷', '미역머리', '리젠트', '올백머리', '시스루 뱅',
        '처피뱅', '바가지 머리', '댕기머리', '벼머리', '드레드록스',
        '올림머리', '포니테일', '사과머리', '꽁지머리', '트윈테일',
        '트윈빔', '트윈드릴', '투 사이드 업', '만두머리', '베이비펌',
        '볼륨 펌', '다운 펌', '스왈로 펌', '쉐도우 펌', '쉼표머리',
        '여신머리', '히메컷', '단발머리', '민머리', '초코송이 머리',
        '대머리', '바보털', '아프로머리', '깻잎머리', '땋은머리',

        '스포츠컷', '뾰족머리', '호일펌'
    ];

    var hairdice;
    hairdice = btnhair[Math.floor(Math.random()*btnhair.length)];
    var btnresult = document.getElementById("btnresult");
    var btntext = '오늘의 헤어스타일은 <span class="color">' + hairdice + "!</span>";
    btnresult.innerHTML = btntext;
}

function btnpersonality1() {
    var btnpersonality1 = [
        '잘 적응하는', '모험심이 강한', '다정한', '경계심이 강한', '야심만만한',
        '분석적인', '고마워할 줄 아는', '대범한', '침착한', '조심성이 많은',
        '중심이 잡힌', '매력적인', '자신감 있는', '협조적인', '용기 있는',
        '예의 바른', '창조적인', '호기심이 많은', '결단력 있는', '협상에 능한',
        '절제력이 있는', '신중한', '느긋한', '효율적인', '공감을 잘하는',
        '열정적인', '외향적인', '대담한', '교태를 부리는', '몰입하는',
        '우호적인', '재미있는', '관대한', '온화한', '행복해하는',
        '정직한', '명예를 중시하는', '환대하는', '겸손한', '이상주의적인',
        '상상력이 풍부한', '독립적인', '부지런한', '순수한', '영감을 주는',
        '지적인', '내성적인', '정의로운', '친절한', '충직한',

        '어른스러운', '자비로운', '꼼꼼한', '자연주의적인', '잘 보살피는',
        '순종적인', '객관적인', '관찰력이 뛰어난', '낙천적인', '조직적인',
        '격정적인', '참을성이 많은', '애국적인', '사색적인', '통찰력 있는',
        '끈기 있는', '설득력 있는', '철학적인', '놀기 좋아하는', '개인적인',
        '주도적인', '전문적인', '정확한', '보호본능이 강한', '별난',
        '지략이 풍부한', '책임감 있는', '양식 있는', '관능적인', '감성이 풍부한',
        '소박한', '사회적 인식이 높은', '교양 있는', '영적인', '즉흥적인',
        '혈기가 왕성한', '학구적인', '조력적인', '재능 있는', '알뜰한',
        '관용적인', '보수적인', '잘 믿는', '자유분방한', '사심이 없는',
        '기발한', '건전한', '현명한', '재치 있는',
    ];

    var personality1;
    personality1 = btnpersonality1[Math.floor(Math.random()*btnpersonality1.length)];
    var btnresult = document.getElementById("btnresult");
    var btntext = '오늘의 긍정적 성격은 <span class="color">' + personality1 + " </span>" + "성격!";
    btnresult.innerHTML = btntext;
}

function btnpersonality2() {
    var btnpersonality2 = [
        '아니꼬운', '중독에 빠지는', '반사회적인', '무관심한','냉담한',
        '심술궂은', '어린아이 같은', '거만한', '강박적인', '대립을 일삼는',
        '지배욕이 강한', '비겁한', '잔인한', '냉소적인', '방어적인',
        '기만적인', '정직하지 못한', '불충한', '체계적이지 못한', '무례한',
        '얼버무리며 회피하는', '악독한', '낭비벽 있는', '광적인', '엉뚱한',
        '어리석은', '잘 잊어버리는', '경박한', '깐깐한', '남의 말을 하기 좋아하는',
        '탐욕스러운', '퉁명스러운', '잘 속는', '오만한', '적대적인',
        '재미없는', '위선적인', '무식한', '성마른', '충동적인',
        '부주의한', '우유부단한', '융통성 없는', '병적으로 내성적인', '불안정한',
        '비이성적인', '무책임한', '질투심이 강한', '비판적인', '뭐든 아는 체하는',

        '게으른', '마초적인', '조종하는', '희생양인 척하는', '물질만능주의인',
        '감정과잉인', '짓궂은', '병적인', '잔소리가 심한', '애정결핍인',
        '신경과민인', '오지랖이 넓은', '집착이 강한', '과민한', '피해망상이 심한',
        '완벽주의인', '비관적인', '소유욕이 강한', '편파적인', '허세를 부리는',
        '문란한', '강압적인', '반항적인', '무모한', '원망하는',
        '말썽을 피우는', '산만한', '자기파괴적인', '방종하는', '이기적인',
        '추잡한', '응석을 부리는', '인색한', '고집불통인', '비굴한',
        '미신을 믿는', '의심이 많은', '눈치 없는', '변덕스러운', '소심한',
        '지나치게 말수가 적은', '비협조적인', '상스러운', '비윤리적인', '고마워할 줄 모르는',
        '우둔한', '허영심이 강한', '지나치게 말이 많은', '앙갚음을 하는', '폭력적인',

        '다혈질인', '의지박약인', '불평이 많은', '움츠러드는', '일중독인',
        '사서 걱정하는',
    ];

    var personality2;
    personality2 = btnpersonality2[Math.floor(Math.random()*btnpersonality2.length)];
    var btnresult = document.getElementById("btnresult");
    var btntext = '오늘의 부정적 성격은 <span class="color">' + personality2 + " </span>" + "성격!";
    btnresult.innerHTML = btntext;
}

function btninstrument() {
    var btninstrument = [
        '찰현악기/바이올린', '찰현악기/일렉트릭 바이올린', '찰현악기/피들', '찰현악기/비올라', '찰현악기/첼로',
        '찰현악기/콘트라베이스', '찰현악기/옥토베이스', '찰현악기/요우힉코', '찰현악기/니켈하르파', '찰현악기/아르페지오네',
        '찰현악기/비올라 다감바', '찰현악기/파르데수스 데 비올', '찰현악기/비올라 다 모레', '찰현악기/바리톤', '찰현악기/구슬레',
        '찰현악기/호금', '찰현악기/호치르', '찰현악기/얼후', '찰현악기/싼후', '찰현악기/쓰후',
        '찰현악기/해금', '찰현악기/마두금', '찰현악기/이킬', '찰현악기/코비즈', '찰현악기/아쟁',

        '찰현악기/코큐', '찰현악기/비잔치', '찰현악기/대마두금', '찰현악기/기작', '발현악기/시타르',
        '발현악기/금', '발현악기/쟁', '발현악기/슬', '발현악기/독현금', '발현악기/거문고',
        '발현악기/가야금', '발현악기/비파', '발현악기/비와', '발현악기/고토', '발현악기/싼시엔',
        '발현악기/샤미센', '발현악기/산신', '발현악기/사즈', '발현악기/공후', '발현악기/월금',
        '발현악기/치터', '발현악기/우드', '발현악기/돔브라', '발현악기/라바브', '발현악기/야특',

        '발현악기/단짜인', '발현악기/텁쇼르', '발현악기/베이스 기타', '발현악기/티체스트 베이스', '발현악기/어쿠스틱 기타',
        '발현악기/일렉트릭 기타', '발현악기/클래식 기타', '발현악기/우쿨렐레', '발현악기/밴조', '발현악기/하프',
        '발현악기/만돌린', '발현악기/발랄라이카', '발현악기/차랑고', '발현악기/리라', '발현악기/류트',
        '발현악기/테오르보', '발현악기/칸텔레', '발현악기/감브리', '발현악기,현명악기/하프시코드', '타현악기,현명악기/양금',
        '타현악기,현명악기/침발롬', '타현악기,현명악기/베림바우', '타현악기,현명악기/클라비코드', '타현악기,현명악기/ 피아노', '현악기/드렐라이어',

        '목관악기/대금', '목관악기/중금', '목관악기/태평소', '목관악기/장새납', '목관악기/소금',
        '목관악기/피리', '목관악기/대피리', '목관악기/저피리', '목관악기/퉁소', '목관악기/단소',
        '목관악기/지', '목관악기/생황', '목관악기/훈', '목관악기/당적', '목관악기/봉소',
        '목관악기/약', '목관악기/적', '목관악기/에웨르 부레', '목관악기/팬플룻', '목관악기/티페',
        '목관악기/트라베르소', '목관악기/오보에 다모레', '목관악기/두둑', '목관악기/소프라노 색소폰', '목관악기/알토 색소폰',

        '목관악기/테너 색소폰', '목관악기/바리톤 색소폰', '목관악기/틴 휘슬(아이리쉬 휘슬)', '목관악기/플루트', '목관악기/피콜로',
        '목관악기/오보에', '목관악기/코랑글레', '목관악기/클라리넷', '목관악기/피콜로 클라리넷', '목관악기/베이스 클라리넷',
        '목관악기/바순', '목관악기/콘트라바순', '목관악기/색소폰', '목관악기/리코더', '목관악기/백파이프',
        '금관악기/나발', '금관악기/호른', '금관악기/트럼펫', '금관악기/코넷', '금관악기/트롬본',
        '금관악기/유포니움', '금관악기/튜바', '금관악기/플루겔혼', '금관악기/오피클라이드', '금관악기/수자폰',

        '폐관악기/멜로디카', '폐관악기/하모니카', '폐관악기/오카리나', '폐관악기/부부젤라', '폐관악기/데스휘슬',
        '막명악기/장구', '막명악기/소고', '막명악기/태고', '막명악기/사물북', '막명악기/소리북',
        '막명악기/츠즈미', '막명악기/다르부카', '막명악기/타블라', '막명악기/베이스드럼', '막명악기/스네어드럼',
        '막명악기/젬베', '막명악기/팀파니', '막명악기/탬버린', '막명악기/톰톰', '막명악기/테너드럼',
        '막명악기/봉고', '막명악기/콩가', '막명악기/토킹 드럼', '막명악기/쿠이카', '체명악기/목어(목탁)',

        '체명악기/떠른', '체명악기/징', '체명악기/탐탐(공)', '체명악기/꽹과리', '체명악기/캐스터네츠',
        '체명악기/행드럼', '체명악기/글로켄슈필', '체명악기/트라이앵글', '체명악기/심벌즈', '체명악기/마림바',
        '체명악기/실로폰', '체명악기/워터폰', '체명악기/카혼', '체명악기/피들스틱', '체명악기/핸드벨',
        '체명악기/엠비라', '체명악기/글라스하모니카', '체명악기/첼레스타', '체명악기/비브라폰', '체명악기/튜블러 벨',
        '체명악기/스틸팬', '체명악기/우드블록', '체명악기/템플블록', '체명악기/핸드팬', '체명악기/클라베스',

        '체명악기/귀로', '체명악기/마라카스', '체명악기/레인스틱', '체명악기/셰이커', '체명악기/카우벨',
        '체명악기/아고고벨', '체명악기/클래퍼', '체명악기/시스트럼', '체명악기/카바사', '체명악기/카시롤라',
        '체명악기/카쉬카', '체명악기/토이 피아노', '체명악기/루테', '체명악기/주즈하프', '건반악기/피아노',
        '건반악기/오르간', '건반악기/반도네온', '건반악기/아코디언', '건반악기/바얀', '건반악기/파이프오르간',
        '건반악기/첼레스타', '건반악기/클라비코드', '건반악기/하프시코드(쳄발로)', '건반악기/하모니움',
    ];

    var instrumentdice;
    instrumentdice = btninstrument[Math.floor(Math.random()*btninstrument.length)];
    var btnresult = document.getElementById("btnresult");
    var btntext = '오늘의 악기는 <span class="color">' + instrumentdice + "!</span>";
    btnresult.innerHTML = btntext;
}

function btnrondomcolor() {
    var letters = '0123456789ABCDEF';
    var color = '#';

    for (var i = 0; i < 6; i++) {
        color = color + letters[Math.floor(Math.random() * 16)];
        var colorCode = color;
    }

    var btnresult = document.getElementById("btnresult");
    var btntext = `
        오늘의 색상은... 이거다!
        <table>
            <tbody>
                <tr>
                    <td class="colorplate2" style="background:${colorCode};"></td>
                </tr>
                <tr>
                    <td class="colorcode">${colorCode}</td>
                </tr>
            </tbody>
        </table>
    `;
    btnresult.innerHTML = btntext;
}

function btnrondom6color() {
    var letters = '0123456789ABCDEF';
    var color1 = '#';
    var color2 = '#';
    var color3 = '#';
    var color4 = '#';
    var color5 = '#';
    var color6 = '#';

    for (var i = 0; i < 6; i++) {
        color1 = color1 + letters[Math.floor(Math.random() * 16)];
        var colorCode1 = color1;
    }

    for (var i = 0; i < 6; i++) {
        color2 = color2 + letters[Math.floor(Math.random() * 16)];
        var colorCode2 = color2;
    }

    for (var i = 0; i < 6; i++) {
        color3 = color3 + letters[Math.floor(Math.random() * 16)];
        var colorCode3 = color3;
    }

    for (var i = 0; i < 6; i++) {
        color4 = color4 + letters[Math.floor(Math.random() * 16)];
        var colorCode4 = color4;
    }

    for (var i = 0; i < 6; i++) {
        color5 = color5 + letters[Math.floor(Math.random() * 16)];
        var colorCode5 = color5;
    }

    for (var i = 0; i < 6; i++) {
        color6 = color6 + letters[Math.floor(Math.random() * 16)];
        var colorCode6 = color6;
    }

    var btnresult = document.getElementById("btnresult");
    var btntext = `
        오늘의 색상은... 이거다!
        <table>
            <tbody>
                <tr>
                    <td class="colorplate2" style="background:${colorCode1};"></td>
                    <td class="colorplate2" style="background:${colorCode2};"></td>
                    <td class="colorplate2" style="background:${colorCode3};"></td>
                    <td class="colorplate2" style="background:${colorCode4};"></td>
                    <td class="colorplate2" style="background:${colorCode5};"></td>
                    <td class="colorplate2" style="background:${colorCode6};"></td>
                </tr>
                <tr>
                    <td class="colorcode">${colorCode1}</td>
                    <td class="colorcode">${colorCode2}</td>
                    <td class="colorcode">${colorCode3}</td>
                    <td class="colorcode">${colorCode4}</td>
                    <td class="colorcode">${colorCode5}</td>
                    <td class="colorcode">${colorCode6}</td>
                </tr>
            </tbody>
        </table>
    `;
    btnresult.innerHTML = btntext;
}

function btncharacterType() {
    var btncharacterType = [
        '주연/주인공', '주연/조력자', '주연/악역', '주연/반동인물', '조연/조력자',
        '조연/악역', '조연/반동인물', '주연/스승', '조연/스승', '주연/라이벌',
        '조연/라이벌', '엑스트라', '주연/선역', '조연/선역', '주연/아군',
        '조연/아군', '주연/적', '조연/적',
    ];

    var characterTypedice;
    characterTypedice = btncharacterType[Math.floor(Math.random()*btncharacterType.length)];
    var btnresult = document.getElementById("btnresult");
    var btntext = '오늘의 캐릭터 유형은 <span class="color">' + characterTypedice + "!</span>";
    btnresult.innerHTML = btntext;
}

function btncharacterImage() {
    var btncharacterImage = [
        '개그 캐릭터', '나르시시즘 캐릭터', '바보 캐릭터', '덜렁이 캐릭터', '호색한 캐릭터',
        '대인배 캐릭터', '중2병 캐릭터', '열혈 캐릭터', '다혈질 캐릭터','쿨한 캐릭터',
        '쿨뷰티(냉정) 캐릭터', '쿨뷰티(무표정) 캐릭터', '냉혈한 캐릭터', '과묵한 캐릭터', '보이쉬 캐릭터',
        '걸리쉬 캐릭터', '괴짜 캐릭터', '다중인격 캐릭터', '게이름뱅이 캐릭터', '마이페이스 캐릭터',
        '천연 캐릭터', '치유계 캐릭터', '강철멘탈 캐릭터', '애어른 캐릭터', '브라콤 캐릭터',
        '시스콤 캐릭터', '천재 캐릭터', '신사 캐릭터', '울보 캐릭터', '겁쟁이 캐릭터',
        '구두쇠 캐릭터', '처녀 캐릭터', '초딩캐릭터', '하라구로 캐릭터', '츤데레(여성형) 캐릭터',
        '츤데레(남성형) 캐릭터', '얀데레(소프트) 캐릭터', '얀데레(하드) 캐릭터', '얀데레(포지티브) 캐릭터', '얀데레(네거티브) 캐릭터',
        '다루데레 캐릭터', '메가데레 캐릭터', '보코데레 캐릭터', '빈데레 캐릭터', '쿨데레 캐릭터',
        '욕데레 캐릭터', '악당 캐릭터', '위선자 캐릭터', '위악자 캐릭터', '정의의 사자',

        '다크 히어로', '복수귀 캐릭터', '안티 히어로', '매국노 캐릭터', '악녀 캐릭터',
        '동물인간 캐릭터', '혼혈 캐릭터', '전투종족 캐릭터', '한국인 캐릭터', '외국인 캐릭터',
        '흑인 캐릭터', '황인 캐릭터', '백인 캐릭터', '노안 캐릭터', '동안 캐릭터',
        '무표정 캐릭터', '색기 캐릭터', '섹시한 캐릭터', '청순한 캐릭터', '귀여운 캐릭터',
        '고양이상 캐릭터', '강아지상 캐릭터', '흑발적안 캐릭터', '금발벽안 캐릭터', '은발적안 캐릭터',
        '실눈 캐릭터', '애꾸눈 캐릭터', '죽는 눈 캐릭터', '오드아이 캐릭터', '로리 캐릭터',
        '쇼타 캐릭터', '무유(가슴없는) 캐릭터', '빈유 캐릭터', '평유 캐릭터', '거유 캐릭터',
        '로리거유 캐릭터', '오토코노코 캐릭터', '여장남자 캐릭터', '남장여자 캐릭터', '근육돼지 캐릭터',
        '단신 캐릭터', '장신 캐릭터', '안경 캐릭터', '방독면 캐릭터', '마약 복용 캐릭터',
        '의수 캐릭터', '의족 캐릭터', '의안 캐릭터', '가운 캐릭터', '치파오 캐릭터',

        '귀고리 착용 캐릭터', '반지 착용 캐릭터', '머리핀 착용 캐릭터', '목걸이 착용 캐릭터', '머리띠 착용 캐릭터',
        '피어싱 착용 캐릭터', '비녀 착용 캐릭터', '헤어밴드 착용 캐릭터', '립스틱 바른 캐릭터', '안대 착용 캐릭터',
        '검사(법조계) 캐릭터', '경찰 캐릭터', '공주 캐릭터', '군인 캐릭터', '매드 사이언티스트 캐릭터',
        '과학자 캐릭터', '기술자 캐릭터', '노예 캐릭터', '귀족 캐릭터', '닌자 캐릭터',
        '독재자 캐릭터', '변호사 캐릭터', '왕자 캐릭터', '평범한 고득학생 캐릭터', '중학생 캐릭터',
        '초등학생 캐릭터', '집사 캐릭터', '투희 캐릭터', '왕 캐릭터', '황제 캐릭터',
        '교사 캐릭터', '요리사 캐릭터', '얼굴을 가린 캐릭터', '폭주하는 캐릭터', '만악의 근원 캐릭터',
        '세계관 최강자 캐릭터', '최종 보스 캐릭터', '예언자 캐릭터', '레즈비언 캐릭터', '게이 캐릭터',
        '양성애자 캐릭터', '건달 캐릭터', '히트맨 캐릭터', '욕쟁이 캐릭터', '반말 캐릭터',
        '말버릇 캐릭터', '존댓말 캐릭터', '오타쿠 캐릭터', '음치 캐릭터', '변신하는 캐릭터',

        '무당 캐릭터', '살인마 캐릭터', '암살자 캐릭터', '스님 캐릭터', '목사 캐릭터',
        '신부(종교) 캐릭터', '사제 캐릭터', '수녀 캐릭터', '사서 캐릭터', '사신 캐릭터',
        '장의사 캐릭터', '암상인 캐릭터', '마법사 캐릭터', '전사 캐릭터', '궁수 캐릭터',
        '도적 캐릭터', '해적 캐릭터', '광전사 캐릭터', '사냥꾼 캐릭터', '격투가 캐릭터',
        '괴도 캐릭터', '광대 캐릭터', '마법소녀 캐릭터', '마녀 캐릭터', '대장장이 캐릭터',

        '마피아 캐릭터', '마왕 캐릭터', '가수 캐릭터', '음유시인 캐릭터', '퇴마사 캐릭터',
        '주술사 캐릭터', '바바리안 캐릭터', '드루이드 캐릭터', '흑기사 캐릭터', '모험가 캐릭터',
        '신관 캐릭터', '성직자 캐릭터', '정비공 캐릭터',
    ];

    var characterImagedice;
    characterImagedice = btncharacterImage[Math.floor(Math.random()*btncharacterImage.length)];
    var btnresult = document.getElementById("btnresult");
    var btntext = '오늘의 캐릭터 이미지는 <span class="color">' + characterImagedice + "!</span>";
    btnresult.innerHTML = btntext;
}

function btnnationality() {
    var btnnationality = [
        '아프카니스탄', '아르메니아', '아제르바이잔', '방글라데시', '브루나이',
        '부탄', '중국', '홍콩', '인도네시아', '인도',
        '일본', '키르기스스탄', '캄보디아', '북한', '한국',
        '카자흐스탄', '라오스', '스리랑카', '미얀마', '몽골',
        '마카오', '몰디브', '말레이지아', '네팔', '필리핀',
        '파키스탄', '싱가포르', '태국', '타지크', '티모르',
        '투르크멘', '대만', '우즈베크', '베트남', '아랍에미리트 연합',
        '바레인', '알제리', '이집트', '이스라엘', '이라크',
        '이란', '요르단', '쿠웨이트', '레바논', '리비아',
        '모로코', '모리타니', '중립지대', '오만', '카타르',

        '사우디아라비아', '수단', '시리아', '튀니지', '예맨',
        '안도라', '알바니아', '오스트리아', '알랜드 군도', '보스니아-헤르체고비나',
        '벨기에', '불가리아', '베라루스', '스위스', '사이프러스',
        '체코공화국', '독일', '덴마크', '에스토니아', '에리트리아',
        '스페인', '핀란드', '파로에 군도', '프랑스', '프랑스 메트로폴리탄',
        '영국', '조지아', '건지', '지브랄타', '그리스',
        '남조지아 & 남샌드위치 군도', '크로아티아', '헝가리', '아일랜드', '맨섬',
        '아이슬란드', '이탈리아', '저어지', '리히텐슈타인', '리투아니아',
        '룩셈부르그', '라트비아', '모나코', '몰도바', '몬테네그로',
        '마세도니아', '몰타', '네덜란드', '노르웨이', '폴란드',

        '포루투갈', '루마니아', '세르비아', '러시아 연방', '스웨덴',
        '슬로베니아', '스발비드 군도', '슬로바키아', '산마리노', '터키',
        '우크라이나', '교황청', '유고', '캐나다', '미국',
        '안티가 바부다', '네덜란드 열도', '안타티카', '아르헨티나', '아루바',
        '바베이도스', '세인트 바르탤르미', '버뮤다', '볼리비아', '보네르 신트외스타티위스',
        '브라질', '바하마', '벨리제', '칠레', '콜롬비아',
        '코스타리카', '쿠바', '큐라소', '도미니카', '도미니카 공화국',
        '에쿠아도르', '포클랜드 군도', '그레나다', '불령 가이아나', '그린랜드',
        '과델로프', '과테말라', '가이아나', '온두라스', '아이티',
        '자마이카', '세인트 키츠 네비스', '영령 캐이맨 군도', '세인트 루시아', '세인트 마틴',

        '미드웨이 군도', '마티니크', '몬트세라트', '멕시코', '니카라과',
        '파나마', '페루', '세인트 피레 미켈론', '푸에르토리코', '파라과이',
        '파나마운하지역', '수리남', '엘살바도르', '투르크 & 카이코스 군도', '트리니다드 토바고',
        '우루과이', '세인트 빈센트 그레나딘', '베네주엘라', '영령 버진군도', '미령 버진군도',
        '앙귈라', '앙골라', '부르키나 파소', '부룬디', '베닝',
        '보빗군도', '보츠와나', '콩고민주공화국', '중앙 아프리카공화국', '콩고',
        '코트디봐르', '카메룬', '카보 베르데', '지부티', '서사하라',
        '이디오피아', '가봉', '가나', '감비아', '기니',
        '적도 기니', '기네비소', '영령 인도양', '케냐', '코모로스',
        '라이베리아', '레소토', '마다카스카르', '말리', '모리셔스',

        '말라위', '모잠비크', '나미비아', '니제르', '나이지리아',
        '팔레스타인 해방기구', '불령 리유니온 코모도 제도', '루안다', '세이쉘', '세인트 헬레나',
        '시에라 리온', '세네갈', '소말리아', '남수단', '상토메 프린스페',
        '스와질랜드', '챠드', '불령 남부지역', '토고', '탄자니아',
        '우간다', '메요트', '남아프리카 공화국', '잠비아', '자이르',
        '짐바브웨', '호주', '쿡 아일랜드', '피지', '괌',
        '뉴 칼레도니아', '나우르', '니우에', '뉴질랜드', '불령 폴리네시아',
        '파푸아 뉴기니', '솔로몬 군도', '토켈라우', '통가', '사모아',
        '아메리칸 사모아', '코스 군도', '캔톤아일랜드', '크리스마스 아일랜드', '마이크로네시아',
        '허드 앤 맥도날드 군도', '존스톤 아일랜드', '키리바티', '마샬군도', '북마리아나 군도',

        '노폴크 아일랜드', '피트카이른', '팔라우', '투발루', '마이너 아우틀링 합중국 군도',
        '바누아투', '왈라스 & 퓨투나 군도', '웨이크 아일랜드', '오스트리아', '벨기에',
        '불가리아', '사이프러스', '체코공화국', '독일', '덴마크',
        '에스토니아', '스페인', '핀란드', '프랑스', '영국',
        '그리스', '크로아티아', '헝가리', '아일랜드', '이탈리아',
        '리투아니아', '룩셈부르그', '라트비아', '몰타', '네덜란드',
        '폴란드', '포루투갈', '루마니아', '스웨덴', '슬로베니아',
        '슬로바키아', '오스트리아', '호주', '벨기에', '캐나다',
        '스위스', '체코공화국', '독일', '덴마크', '스페인',
        '핀란드', '프랑스', '영국', '그리스', '헝가리',

        '아일랜드', '아이슬란드', '이탈리아', '일본', '한국',
        '룩셈부르그', '멕시코', '네덜란드', '노르웨이', '뉴질랜드',
        '폴란드', '포루투갈', '스웨덴', '슬로바키아', '터키',
        '미국', '브루나이', '인도네시아', '캄보디아', '라오스',
        '미얀마', '말레이지아', '필리핀', '싱가포르', '태국',
        '베트남', '아르메니아', '아제르바이잔', '베라루스', '조지아',
        '키르기스스탄', '카자흐스탄', '몰도바', '러시아 연방', '타지크',
        '투르크멘', '우크라이나', '우즈베크', '캐나다', '멕시코',
        '미국', '호주', '브루나이', '캐나다', '칠레',
        '중국', '홍콩', '인도네시아', '일본', '한국',

        '멕시코', '말레이지아', '뉴질랜드', '페루', '파푸아 뉴기니',
        '필리핀', '러시아 연방', '싱가포르', '태국', '대만',
        '미국', '베트남', '브루나이', '홍콩', '인도네시아',
        '캄보디아', '라오스', '미얀마', '말레이지아', '필리핀',
        '싱가포르', '태국', '대만', '베트남', '알바니아',
        '보스니아-헤르체고비나', '불가리아', '체코공화국', '헝가리', '몬테네그로',
        '마세도니아', '폴란드', '루마니아', '세르비아', '슬로베니아',
        '슬로바키아', '마세도니아', '유고', '오스트리아', '벨기에',
        '브루나이', '중국', '독일', '덴마크', '스페인',
        '핀란드', '프랑스', '영국', '그리스', '인도네시아',

        '아일랜드', '이탈리아', '일본', '한국', '룩셈부르그',
        '말레이지아', '네덜란드', '필리핀', '포루투갈', '스웨덴',
        '싱가포르', '태국', '베트남', '스위스', '아이슬란드',
        '리히텐슈타인', '노르웨이', '아르헨티나', '브라질', '파라과이',
        '우루과이',
    ];

    var nationalitydice;
    nationalitydice = btnnationality[Math.floor(Math.random()*btnnationality.length)];
    var btnresult = document.getElementById("btnresult");
    var btntext = '오늘의 국적은 <span class="color">' + nationalitydice + "!</span>";
    btnresult.innerHTML = btntext;
}

function word() {
    var word = [];

    var dice;
    dice = word[Math.floor(Math.random()*word.length)];
    var btnresult = document.getElementById("btnresult");
    var btntext = '<span class="color">' + dice + " </span>" + "문구";
    btnresult.innerHTML = btntext;
}