function btninstrument() {
  var btninstrument = [
    '찰현악기/바이올린', '찰현악기/일렉트릭 바이올린', '찰현악기/피들', '찰현악기/비올라', '찰현악기/첼로',
    '찰현악기/콘트라베이스', '찰현악기/옥토베이스', '찰현악기/요우힉코', '찰현악기/니켈하르파', '찰현악기/아르페지오네',
    '찰현악기/비올라 다감바', '찰현악기/파르데수스 데 비올', '찰현악기/비올라 다 모레', '찰현악기/바리톤', '찰현악기/구슬레',
    '찰현악기/호금', '찰현악기/호치르', '찰현악기/얼후', '찰현악기/싼후', '찰현악기/쓰후',
    '찰현악기/해금', '찰현악기/마두금', '찰현악기/이킬', '찰현악기/코비즈', '찰현악기/아쟁',

    '찰현악기/코큐', '찰현악기/비잔치', '찰현악기/대마두금', '찰현악기/기작', '발현악기/시타르',
    '발현악기/금', '발현악기/쟁', '발현악기/슬', '발현악기/독현금', '발현악기/거문고',
    '발현악기/가야금', '발현악기/비파', '발현악기/비와', '발현악기/고토', '발현악기/싼시엔',
    '발현악기/샤미센', '발현악기/산신', '발현악기/사즈', '발현악기/공후', '발현악기/월금',
    '발현악기/치터', '발현악기/우드', '발현악기/돔브라', '발현악기/라바브', '발현악기/야특',

    '발현악기/단짜인', '발현악기/텁쇼르', '발현악기/베이스 기타', '발현악기/티체스트 베이스', '발현악기/어쿠스틱 기타',
    '발현악기/일렉트릭 기타', '발현악기/클래식 기타', '발현악기/우쿨렐레', '발현악기/밴조', '발현악기/하프',
    '발현악기/만돌린', '발현악기/발랄라이카', '발현악기/차랑고', '발현악기/리라', '발현악기/류트',
    '발현악기/테오르보', '발현악기/칸텔레', '발현악기/감브리', '발현악기,현명악기/하프시코드', '타현악기,현명악기/양금',
    '타현악기,현명악기/침발롬', '타현악기,현명악기/베림바우', '타현악기,현명악기/클라비코드', '타현악기,현명악기/ 피아노', '현악기/드렐라이어',

    '목관악기/대금', '목관악기/중금', '목관악기/태평소', '목관악기/장새납', '목관악기/소금',
    '목관악기/피리', '목관악기/대피리', '목관악기/저피리', '목관악기/퉁소', '목관악기/단소',
    '목관악기/지', '목관악기/생황', '목관악기/훈', '목관악기/당적', '목관악기/봉소',
    '목관악기/약', '목관악기/적', '목관악기/에웨르 부레', '목관악기/팬플룻', '목관악기/티페',
    '목관악기/트라베르소', '목관악기/오보에 다모레', '목관악기/두둑', '목관악기/소프라노 색소폰', '목관악기/알토 색소폰',

    '목관악기/테너 색소폰', '목관악기/바리톤 색소폰', '목관악기/틴 휘슬(아이리쉬 휘슬)', '목관악기/플루트', '목관악기/피콜로',
    '목관악기/오보에', '목관악기/코랑글레', '목관악기/클라리넷', '목관악기/피콜로 클라리넷', '목관악기/베이스 클라리넷',
    '목관악기/바순', '목관악기/콘트라바순', '목관악기/색소폰', '목관악기/리코더', '목관악기/백파이프',
    '금관악기/나발', '금관악기/호른', '금관악기/트럼펫', '금관악기/코넷', '금관악기/트롬본',
    '금관악기/유포니움', '금관악기/튜바', '금관악기/플루겔혼', '금관악기/오피클라이드', '금관악기/수자폰',

    '폐관악기/멜로디카', '폐관악기/하모니카', '폐관악기/오카리나', '폐관악기/부부젤라', '폐관악기/데스휘슬',
    '막명악기/장구', '막명악기/소고', '막명악기/태고', '막명악기/사물북', '막명악기/소리북',
    '막명악기/츠즈미', '막명악기/다르부카', '막명악기/타블라', '막명악기/베이스드럼', '막명악기/스네어드럼',
    '막명악기/젬베', '막명악기/팀파니', '막명악기/탬버린', '막명악기/톰톰', '막명악기/테너드럼',
    '막명악기/봉고', '막명악기/콩가', '막명악기/토킹 드럼', '막명악기/쿠이카', '체명악기/목어(목탁)',

    '체명악기/떠른', '체명악기/징', '체명악기/탐탐(공)', '체명악기/꽹과리', '체명악기/캐스터네츠',
    '체명악기/행드럼', '체명악기/글로켄슈필', '체명악기/트라이앵글', '체명악기/심벌즈', '체명악기/마림바',
    '체명악기/실로폰', '체명악기/워터폰', '체명악기/카혼', '체명악기/피들스틱', '체명악기/핸드벨',
    '체명악기/엠비라', '체명악기/글라스하모니카', '체명악기/첼레스타', '체명악기/비브라폰', '체명악기/튜블러 벨',
    '체명악기/스틸팬', '체명악기/우드블록', '체명악기/템플블록', '체명악기/핸드팬', '체명악기/클라베스',

    '체명악기/귀로', '체명악기/마라카스', '체명악기/레인스틱', '체명악기/셰이커', '체명악기/카우벨',
    '체명악기/아고고벨', '체명악기/클래퍼', '체명악기/시스트럼', '체명악기/카바사', '체명악기/카시롤라',
    '체명악기/카쉬카', '체명악기/토이 피아노', '체명악기/루테', '체명악기/주즈하프', '건반악기/피아노',
    '건반악기/오르간', '건반악기/반도네온', '건반악기/아코디언', '건반악기/바얀', '건반악기/파이프오르간',
    '건반악기/첼레스타', '건반악기/클라비코드', '건반악기/하프시코드(쳄발로)', '건반악기/하모니움',
  ];

  var instrumentdice;
  instrumentdice = btninstrument[Math.floor(Math.random() * btninstrument.length)];
  var btnresult = document.getElementById("btnresult");
  var btntext = '오늘의 악기는 <span class="color">' + instrumentdice + "!</span> (" + btninstrument.length + "개)";
  btnresult.innerHTML = btntext;
} // 악기

function btnrondomcolor() {
  var letters = '0123456789ABCDEF';
  var color = '#';

  for (var i = 0; i < 6; i++) {
    color = color + letters[Math.floor(Math.random() * 16)];
    var colorCode = color;
  }

  var btnresult = document.getElementById("btnresult");
  var btntext = `
        오늘의 색상은... 이거다!<br />
        <div class="colorbox">
	        <div class="colorplate2" style="background:${colorCode};"></div>
	        <div class="colorcode">${colorCode}</div>
				</div>
    `;
  btnresult.innerHTML = btntext;
} // 랜덤 색상

function btnrondom6color() {
  var letters = '0123456789ABCDEF';
  var color1 = '#';
  var color2 = '#';
  var color3 = '#';
  var color4 = '#';
  var color5 = '#';
  var color6 = '#';

  for (var i = 0; i < 6; i++) {
    color1 = color1 + letters[Math.floor(Math.random() * 16)];
    var colorCode1 = color1;
  }

  for (var i = 0; i < 6; i++) {
    color2 = color2 + letters[Math.floor(Math.random() * 16)];
    var colorCode2 = color2;
  }

  for (var i = 0; i < 6; i++) {
    color3 = color3 + letters[Math.floor(Math.random() * 16)];
    var colorCode3 = color3;
  }

  for (var i = 0; i < 6; i++) {
    color4 = color4 + letters[Math.floor(Math.random() * 16)];
    var colorCode4 = color4;
  }

  for (var i = 0; i < 6; i++) {
    color5 = color5 + letters[Math.floor(Math.random() * 16)];
    var colorCode5 = color5;
  }

  for (var i = 0; i < 6; i++) {
    color6 = color6 + letters[Math.floor(Math.random() * 16)];
    var colorCode6 = color6;
  }

  var btnresult = document.getElementById("btnresult");
  var btntext = `
        오늘의 색상은... 이거다!<br />
        <div class="colorbox">
	        <div class="colorplate2" style="background:${colorCode1};"></div>
	        <div class="colorcode">${colorCode1}</div>
				</div>
				<div class="colorbox">
	        <div class="colorplate2" style="background:${colorCode2};"></div>
	        <div class="colorcode">${colorCode2}</div>
				</div>
				<div class="colorbox">
	        <div class="colorplate2" style="background:${colorCode3};"></div>
	        <div class="colorcode">${colorCode3}</div>
				</div>
				<div class="colorbox">
	        <div class="colorplate2" style="background:${colorCode4};"></div>
	        <div class="colorcode">${colorCode4}</div>
				</div>
				<div class="colorbox">
	        <div class="colorplate2" style="background:${colorCode5};"></div>
	        <div class="colorcode">${colorCode5}</div>
				</div>
				<div class="colorbox">
	        <div class="colorplate2" style="background:${colorCode6};"></div>
	        <div class="colorcode">${colorCode6}</div>
				</div>
    `;
  btnresult.innerHTML = btntext;
} // 랜덤 6색

function btnjewels() {
  var btnjewels = [
    '금 (金/Gold)',
    '은 (銀/Silver)',
    '백금 (白金/Platinum)',
    '금강석 (金剛石/Diamond)',
    '석류석 (石榴石/Garnet)',
    '홍(紅)석류석 (적색계통/Pyrope)',
    '망간 석류석 (오랜지색 계통/Spessartine)',
    '귀(貴)석류석(적색계통/Almandine)',
    '회(灰) 석류석 (녹색계통/Uvarovite)',
    '녹(綠)석류석 (갈색계통/Hessonite)',
    '핑크 그로슐라 (Pink Grossular)',
    '그린 그로슐라 (Green Grossular)',
    '가닛-탑드 더블릿 (Garnet-Topped Doublet)',
    '취(翠) 석류석 (andradite Garnet)',
    '비취 석류석 (Demantoid)',
    '황색 석류석 (石榴石/Topazolite)',
    '검은 석류석 (石榴石/Melanite)',
    '황철석 (黃鐵石/Pyrite)',
    '섬아연석 (閃亞鉛石/Sphalerite)',
    '첨정석 (尖晶石/Spinel)',
    '형석 (螢石/Fluorite)',
    '방조달석 (方曺達石/Sodalite)',
    '남방석 (藍方石/Hauyne)',
    '청금석 (靑金石/Lapis Lazuli)',
    '회중석 (灰重石/Scheelite)',
    '주석석/천석 (朱錫石/川錫/Cassiterite)',
    '주석 (柱石/Scapolite)',
    '금홍석 (金紅石/Rutile)',
    '풍신자석 (風信子石/Zircon)',
    '베스비아나이트 (Vesuvianite)',
    '베스브석 (石/Idocrase)',
    '캘리포니아석 (石/Californite)',
    '사이프린 (Cyprine)',
    '잔타이트 (Xanthite)',
    '와일루아이트 (Wiluite)',
    '터그투파이트 (Tugtupite)',
    '녹주석 (綠柱石/Beryl)',
    '취옥 (翠玉/Emerald)',
    '남옥 (藍玉/Aquamarine)',
    '황색녹주석 (綠柱石/Heliodor)',
    '무색 녹주석 (綠柱石/Goshenite)',
    '장미빛의 녹주석 (綠柱石/Morganite)',
    '장미빛 녹주석 (Red beryl)',
    '인회석 (燐灰石/Apatite)',
    '타페이트 (Taaffeite)',
    '베니토아이트 (Benitoite)',
    '석영 (石英/Quartz)',
    '수정 (水晶/Rock crystal)',
    '자수정 (紫水晶/Amethyst)',
    '황수정 (黃水晶/Citrine)',
    '장미수정 (薔薇水晶/Rose Quartz)',
    '브라운 쿼츠 (Brown Quartz)',
    '연수정 (煙水晶/Smoky quartz)',
    '흑수정 (黑水晶/Morion)',
    '연수정 (煙水晶/Cairngorm)',
    '사금석 (砂金石/Aventurine Quartz)',
    '유백석영 (乳白石英/Milky Quartz)',
    "<br/>색이 변하는 석영(Chatoyant Quartz)<br/>묘안석 (猫眼石/Cat's eye)<br/>",
    "<br/>색이 변하는 석영(Chatoyant Quartz)<br/>호안석 (虎眼石/Tiger's eye)<br/>",
    "<br/>색이 변하는 석영(Chatoyant Quartz)<br/>응안석 (鷹眼石/Hawk's eye)<br/>",
    '침석 (針石/Rutilated quartz)',
    '전기석(電氣石) 쿼츠 (Tourmalinated quartz)',
    '황금 석영 (Gold quartz)',
    '덴드라이트 쿼츠 (Dendrite quartz)',
    '침철석(針鐵石) 쿼츠 (Goethite quartz)',
    '옥수 (玉髓/Chalcedony)',
    '화마노 (火瑪瑙/Fire Agate)',
    '마노 (瑪瑙/Agate)',
    '태마노 (苔瑪瑙/Moss Agate)',
    '석화목 (石化木/Petrified Wood)',
    '규화목 (硅化木/Silicified Wood)',
    '호마노 (縞瑪瑙/Onyx)',
    '자마노/홍옥수 (紫瑪瑙/紅玉髓/Sard)',
    '붉은 줄 마노 (Sardonyx)',
    '녹옥수 (錄玉髓/Chrysoprase)',
    '녹석영 (綠石英/Prase)',
    '벽옥 (碧玉/Jasper)',
    '백색(회색), 적색 벽옥 (碧玉/Oricular)',
    '줄무늬 벽옥 (碧玉/Riband)',
    '각암(角岩) 벽옥 (碧玉/Hornstone)',
    '홍옥수 (紅玉髓/Carnelian)',
    '혈석 (血石/Blood Stone)',
    '녹옥수 (綠玉髓/Plasma)',
    '강옥 (鋼玉/Corundum)',
    '홍옥 (紅玉/Ruby)',
    '청옥 (靑玉/Sapphire)',
    '파파라차 사파이어 (Padparadscha)',
    '칼라리스 사파이어 (Colourless Sapphire)',
    '그린 사파이어 (Green Sapphire)',
    '핑크 사파이어 (Pink Sapphire)',
    '옐로우 사파이어 (Yellow Sapphire)',
    '방해석 (方解石/Calcite)',
    '페나카이트 (Phenakite)',
    '취동석 (翠銅石/Dioptase)',
    '백운석 (白雲石/Dolomite)',
    '능아연석 (菱亞鉛石/Smithsonite)',
    '능망간석 (Rhodochrosite)',
    '적철석 (赤鐵石/Hematite)',
    '전기석 (電氣石/Tourmaline)',
    '홍전기석 (紅電氣石/Rubellite)',
    '남(藍)전기석(石) (Indicolite)',
    '시베리아 전기석 (Siberite)',
    '갈전기석 (褐電氣石/Dravite)',
    '무색 전기석 (電氣石/Achroite)',
    '분홍, 녹색 전기석 (Watermelon Tourmaline)',
    '흑전기석 (黑電氣石/Schorl)',
    '선석 (霰石/Aragonite)',
    '중정석 (重晶石/Baryte)',
    '천청석 (天靑石/Celestine)',
    '백연광석 (白鉛鑛石/Cerussite)',
    '황옥 (黃玉/Topaz)',
    '금록석 (金綠石/Chrysoberyl)',
    '홍주석 (紅柱石/Andalusite)',
    '붕규산 석회 (硼硅酸 石灰/Danburite)',
    '완화석 (頑火石/엔스터타이트)',
    '휘석 (輝石/Pyroxene)',
    '규선석 (珪線石/Sillimanite)',
    '자소휘석 (紫蘇輝石/Hypersthene)',
    '고동석 (古銅石/Bronzite)',
    '근청석 (菫靑石/Iolite)',
    '코르네르핀 (Kornerupine)',
    '감람석 (橄欖石/Peridot)',
    '황산연 (Anglesite)',
    '신할라이트 (Sinhalite)',
    '함베르자이트 (Hambergite)',
    '포도석 (葡萄石/Prehnite)',
    '유렴석 (黝簾石/Zoisite)',
    '유렴석 (黝簾石/자주색계통/Tanzanite)',
    '유렴석 (黝簾石/적색계통/Thulite)',
    '십자석 (十字石/Staurolite)',
    '듀모티어석 (Dumortierite)',
    '베릴로나이트 (Beryllonite)',
    '브라질리언나이트 (Brazilianite)',
    '투휘석 (透輝石/Diopside)',
    '크롬 투휘석 (透輝石/Chrome diopside)',
    '청보라색 투휘석 (Violane)',
    '해포석 (海泡石/Merrshaum)',
    '유휘석 (유輝石/Spodumene)',
    '쿤자이트 (분홍색계통 유휘석/Kunzite)',
    '히데나이트 (녹색계통 유휘석/Hiddenite)',
    '녹렴석/홍렴석 (祿簾石/紅簾石/Epidote)',
    '초석 (梢石/Titanite)',
    '장석 (長石/Feldspar)',
    '알칼리 장석(~長石/Alkali feldspar)',
    '사장석 (斜長石/Plagioclase feldspar)',
    '정장석 (正長石/orthoclase)',
    '빙장석 (氷長石/Adularia/Colourless Orthoclase)',
    '옐로우 오서클레이스 (Yellow Orthoclase)',
    '월장석 (月長石/Moon stone)',
    '미사장석 (微斜長石/Microcline)',
    '천하석 (天河石/Amazonite)',
    '옥 (玉/Jade)',
    '경옥 (硬玉/Jadeite)',
    '연옥 (軟玉/Nephrite)',
    '공작석 (孔雀石/Malachite)',
    '규공작석 (珪孔雀石/Chrysocolla)',
    '남동석 (藍銅石/Azurite)',
    '사문석 (蛇紋石/Serpentine)',
    '녹색 사문석 (蛇紋石/Bowenite)',
    '윌리암사이트 (Williamsite)',
    '포스포필라이트 (Phosphophyllite)',
    '천남석 (天藍石/Lazulite)',
    '하울라이트 (Howlite)',
    '석고 (石膏/Gypsum)',
    '설화석고 (雪花石膏/Alabaster)',
    '투석고 (透石膏/Selenite)',
    '섬유석고 (纖維石膏/Satin spar)',
    '사막 장미석 (Desert rose)',
    '대토석 (Datolite)',
    '엽장석 (葉長石/Petalite)',
    '유클레이스 (Euclase)',
    '조장석 (曹長石/Albite)',
    '회장석 (灰長石/Anorthite)',
    '청색 조장석 (曹長石/Peristerite)',
    '회조장석 (灰曺長石/Oligoclase)',
    '일장석 (日長石/Sunstone)',
    '조회장석 (曺灰長石/Labradorite)',
    '터키석, 녹송 (綠松/Turquoise)',
    '장미휘석 (Rhodonite)',
    '인반석 (燐磐石/Amblygonite)',
    '부석 (斧石/Axinite)',
    '남정석 (藍晶石/Kyanite)',
    '단백석 (蛋白石/Opal)',
    '흑요석 (黑曜石/Obsidian)',
    '텍타이트 (Tektites)',
    '진주 (眞珠/Pearl)',
    '흑옥 (黑玉/Jet)',
    '산호 (珊瑚/Coral)',
    '패각 (貝殼/Shell)',
    '상아 (象牙/Ivory)',
    '호박석 (Amber)',
  ];

  var btnjewelsdice;
  btnjewelsdice = btnjewels[Math.floor(Math.random() * btnjewels.length)];
  var btnresult = document.getElementById("btnresult");
  var btntext = `오늘의 보석은 <span class="color">${btnjewelsdice}!</span> (${btnjewels.length}개)`;
  btnresult.innerHTML = btntext;
} // 보석

function btnflowers() {
  var btnflowers = [
    '가드니아', '가자니아', '개구리자리', '개나리', '개량망초',
    '개망초', '갯뫼꽃', '거베라', '게발선인장', '게인베고니아',
    '겹벚꽃', '겹채송화', '겹황매화', '고들빼기', '고려영산홍',
    '고산 두견화', '고산 설앵초', '골담초', '공작선인장', '과꽃',
    '구슬붕이', '구절초', '국화', '군자란', '글록시니아',
    '금계국', '금낭화', '금방망이', '금불초', '금사매',
    '금어초', '금잔화', '기생꽃', '꽃기린', '꽃마리',
    '꽃사과', '꽃잔디', '꽃쥐손이', '꽃향유', '나난클로스',
    '나리꽃', '나팔꽃', '난꽃', '너도 샤프란', '너도부추',
    '노랑마가렛', '노랑매미꽃', '노랑제비꽃', '능소화', '다알리아',

    '다키탈리스', '달래', '달리아', '달맞이꽃', '당근꽃',
    '당아욱', '데이지', '덴드로비움', '델피니움', '도라지',
    '도토리 나무', '돌단풍', '동백꽃', '둥근이질풀', '들국화',
    '등나무', '등심붓꽃', '디기탈리스', '디모르포테카', '라그라스',
    '라넌큘러스', '라벤더', '라일락', '라펄', '라플레시아',
    '란타나', '로벨리아', '로비비아', '루드베키아', '루핀',
    '리빙스톤 데이지', '리시안셔스', '리아트리스', '마가렛', '마늘덩굴',
    '만냥금', '만수국', '만첩살구꽃', '망초', '매발톱꽃',
    '매화', '메리골드', '메밀꽃', '명자꽃', '모과',
    '모란', '모싯대꽃', '목단꽃', '목련', '무궁화',

    '무늬 뭿미나리', '무스카리', '무화과', '물망초', '물양귀비',
    '미들미스트 카멜리아', '미선나무', '미스티블루', '민들레', '배나무꽃',
    '배풍동', '백당나무', '백도라지꽃', '백련', '백목련',
    '백일홍', '백합', '백화등', '뱀딸기', '벌개미취',
    '범의 꼬리', '벚꽃', '베고니아', '별꽃', '복사꽃',
    '봉선화', '부레옥잠', '부바르디아', '부추꽃', '부켄베리아',
    '불노사 노란연꽃', '불두화', '붉은 아카시아', '블루 세이지', '블루벨',
    '비비추', '비올라', '빨간 하늘나리꽃', '사계 패랭이', '사계국화',
    '사과꽃', '사루비아', '사이프러스', '사프란', '사피니아',
    '산국', '산달래', '산딸나무', '산수유', '산철죽',

    '산파첸스', '삼잎국화', '상록으아리', '상사화', '샤스타 데이지',
    '샤프란', '서부 해당화', '서부해당화', '석산', '석죽',
    '설구화', '설악초', '섬매발톱', '세인트 존 스워트', '세인트폴리아',
    '소국', '솔채', '솔체꽃', '수국', '수레국화',
    '수련', '수선국', '수선화', '수수꽃다리', '스위트피',
    '스타치스', '스토커', '스톡', '시계꽃', '시네라리아',
    '시네신스', '시클라멘', '십자화꽃', '아가판서스', '아네모네',
    '아마릴리스', '아이리스', '아카시아', '아케라텀', '아티초크',
    '안개꽃', '안투리움', '알라만다', '알리섬', '알리움',
    '알스트로메리아', '애기범부채', '앵두꽃', '양귀비', '양지꽃',

    '얼레지', '엉겅퀴', '엉겅퀴꽃', '여로', '여우꼬리',
    '연꽃', '연산홍', '영춘화', '오니소갈룸', '옥매',
    '온시디움', '올괴불나무', '왕보리수', '원추리', '원추천인국',
    '유리호프스', '유성류', '유채꽃', '유홍초', '은방울꽃',
    '익모초', '인동초', '자귀나무꽃', '자마이카', '자목련',
    '자운영', '자주쓴풀', '작약', '잔대꽃', '장미',
    '재스민', '절굿대', '제라늄', '제비꽃', '제이드 바인',
    '제주아그배', '제피란셔스', '주름잎', '진달래', '찔레꽃',
    '차이브', '참나리', '참사랑초', '채송화', '천인국',
    '철쭉', '청사초롱', '체리메이딜란드', '체리세이지', '초롱꽃',

    '초콜릿 코스모스', '치자꽃', '카나리아박태기', '카네이션', '카랑코에',
    '카틀레아', '캠피온', '코스모스', '쿠페아', '크로바꽃',
    '크로산드라', '크로코스', '큰까치수염', '클레마티스', '투구꽃',
    '튤립', '파꽃', '팔꽃나무', '팔레놉시스', '팟메리골드',
    '패랭이꽃', '팬지', '페튜니아', '포인세티아', '퐁퐁국화',
    '풀모나리아', '풀솜대', '풍도바람꽃', '풍접초', '프리뮬러',
    '프리지아', '피소스테기아', '핍팔라', '핑크수국', '하늘말나리',
    '하얀금낭화', '하와이무궁화', '학자스민', '한계령풀', '한련화',
    '할미꽃', '함박꽃나무', '해당화', '해바라기', '해초',
    '헤더', '협죽도', '호주매화', '홍련', '황금 달맞이꽃',

    '황련', '황매화', '후룩스', '휴케라', '흰색 수선화',
    '히나아나레', '히말라야 두견화', '히말리만 메이애플', '히말리안 바람꽃', '히아신스',
  ];

  var btnflowersdice;
  btnflowersdice = btnflowers[Math.floor(Math.random() * btnflowers.length)];
  var btnresult = document.getElementById("btnresult");
  var btntext = `
    <p>오늘의 꽃은 <span class="color">${btnflowersdice}!</span> (${btnflowers.length}개)</p><br />
    <p style="font-size: 14pt;">수집 기준 1. 최대한 이뻐보이는 꽃들</p>
    <p style="font-size: 14pt;">수집 기준 2. 어디선가 한 번은 들어봤던 꽃들</p>
    <p style="font-size: 14pt;">네이버 지식백과의 도움 ^^</p>
  `;
  btnresult.innerHTML = btntext;
} // 꽃

function btndate() {
  var btndate = [
    '28일', '29일',
  ];

  var datedice;
  datedice = btndate[Math.floor(Math.random() * btndate.length)];

  var months = [
    '1', '2', '3', '4', '5',
    '6', '7', '8', '9', '10',
    '11', '12',
  ];

  var days1 = [
    '1', '2', '3', '4', '5',
    '6', '7', '8', '9', '10',
    '11', '12', '13', '14', '15',
    '16', '17', '18', '19', '20',
    '21', '22', '23', '24', '25',
    '26', '27', '28', '29', '30',
    '31',
  ];

  var days2 = [
    '1', '2', '3', '4', '5',
    '6', '7', '8', '9', '10',
    '11', '12', '13', '14', '15',
    '16', '17', '18', '19', '20',
    '21', '22', '23', '24', '25',
    '26', '27', '28', '29', '30',
  ];

  var days3 = [
    '1', '2', '3', '4', '5',
    '6', '7', '8', '9', '10',
    '11', '12', '13', '14', '15',
    '16', '17', '18', '19', '20',
    '21', '22', '23', '24', '25',
    '26', '27', '28', '29',
  ];

  var days4 = [
    '1', '2', '3', '4', '5',
    '6', '7', '8', '9', '10',
    '11', '12', '13', '14', '15',
    '16', '17', '18', '19', '20',
    '21', '22', '23', '24', '25',
    '26', '27', '28',
  ];

  var monthsdice = months[Math.floor(Math.random() * months.length)];

  switch (monthsdice) {
    case '1':
      var diceTotal = (days1.length * 7) + (days2.length * 4) + days4.length;
      var daysdice = days1[Math.floor(Math.random() * days1.length)];
      break;
    case '2':
      if (datedice == '28일') {
        var diceTotal = (days1.length * 7) + (days2.length * 4) + days4.length;
        var daysdice = days4[Math.floor(Math.random() * days4.length)];
      } else if (datedice == '29일') {
        var diceTotal = (days1.length * 7) + (days2.length * 4) + days3.length;
        var daysdice = days3[Math.floor(Math.random() * days3.length)];
      }
      break;
    case '3':
      var diceTotal = (days1.length * 7) + (days2.length * 4) + days4.length;
      var daysdice = days1[Math.floor(Math.random() * days1.length)];
      break;
    case '4':
      var diceTotal = (days1.length * 7) + (days2.length * 4) + days4.length;
      var daysdice = days2[Math.floor(Math.random() * days2.length)];
      break;
    case '5':
      var diceTotal = (days1.length * 7) + (days2.length * 4) + days4.length;
      var daysdice = days1[Math.floor(Math.random() * days1.length)];
      break;
    case '6':
      var diceTotal = (days1.length * 7) + (days2.length * 4) + days4.length;
      var daysdice = days2[Math.floor(Math.random() * days2.length)];
      break;
    case '7':
      var diceTotal = (days1.length * 7) + (days2.length * 4) + days4.length;
      var daysdice = days1[Math.floor(Math.random() * days1.length)];
      break;
    case '8':
      var diceTotal = (days1.length * 7) + (days2.length * 4) + days4.length;
      var daysdice = days1[Math.floor(Math.random() * days1.length)];
      break;
    case '9':
      var diceTotal = (days1.length * 7) + (days2.length * 4) + days4.length;
      var daysdice = days2[Math.floor(Math.random() * days2.length)];
      break;
    case '10':
      var diceTotal = (days1.length * 7) + (days2.length * 4) + days4.length;
      var daysdice = days1[Math.floor(Math.random() * days1.length)];
      break;
    case '11':
      var diceTotal = (days1.length * 7) + (days2.length * 4) + days4.length;
      var daysdice = days2[Math.floor(Math.random() * days2.length)];
      break;
    case '12':
      var diceTotal = (days1.length * 7) + (days2.length * 4) + days4.length;
      var daysdice = days1[Math.floor(Math.random() * days1.length)];
      break;
  }

  var btnresult = document.getElementById("btnresult");
  var btntext = `오늘의 날짜는 <span class="color">${monthsdice}월 ${daysdice}일!</span> (${diceTotal}일 기준)`;
  btnresult.innerHTML = btntext;
} // 날짜

function btnanimals() {
  var btnanimals = [
    '고든 세터', '골든 리트리버', '그레이트 데인', '그레이트 스위스 마운틴 도그', '그레이트 피레네',
    '그레이하운드', '글렌 오브 이말 테리어', '네오폴리탄 마스티프', '노르웨이안 부훈트', '노르웨이 엘크 하운드',
    '노리치 테리어', '노바 스코셔 덕 톨링 레트리버', '노퍽 테리어', '뉴펀들랜드', '닥스훈트',
    '달마시안', '댄디 딘몬트 테리어', '도고 까나리오', '도그 드 보르도', '도베르만 핀셔',
    '도사견', '동경견', '라사압소', '라포니안 허더', '래브라도 레트리버',
    '레이크랜드 테리어', '로디지아 리지백', '로첸', '로트와일러', '마스티프',
    '맨체스터 테리어', '몰티즈', '미니어처 불 테리어', '미니어처 슈나우저', '미니어처 핀셔',
    '바센지', '바셋 하운드', '버니즈 마운틴 도그', '베들링턴 테리어', '벨기에 말리노이즈',
    '벨기에 시프도그', '벨기에 테뷰런', '벨지안 그리펀', '벨지안 셰퍼드 독', '보더콜리',
    '보더 테리어', '보르조이', '보스롱', '보스턴 테리어', '복서',

    '볼로네즈', '부비에 데 플랑드르', '불도그', '불 마스티프', '불 테리어',
    '브뤼셀 그리펀', '브리아드', '브리타니', '블랙 러시안 테리어', '블랙 앤드 탄 쿤하운드',
    '블러드 하운드', '비글', '비숑 프리제', '비어디드 콜리', '비즐라',
    '사모예드', '살루키', '삽살개', '서식스 스패니얼', '세인트 버나드',
    '셔틀랜드 시프도그', '소프트 코티드 휘튼 테리어', '스무드 폭스 테리어', '스위디쉬 발훈트', '스카이 테리어',
    '스코티시 디어하운드', '스코티시 테리어', '스키퍼키', '스태퍼드셔 불 테리어', '스탠더드 슈나우저',
    '스패니쉬 그레이 하운드', '스페니쉬 마스티프', '스피노네 이탈리아노', '시바 이누', '시베리언 허스키',
    '시추', '실리엄 테리어', '실키 테리어', '아나톨리아 셰퍼드', '아메리칸 스태퍼드셔 테리어',
    '아메리칸 아키다', '아메리칸 에스키모 도그', '아메리칸 워터 스패니얼', '아메리칸 폭스하운드', '아이리쉬 소프트코티드 휘튼 테리어',
    '아이리시 레드 앤드 화이트 세터', '아이리시 세터', '아이리시 울프 하운드', '아이리시 워터 스패니얼', '아이리시 테리어',

    '아키타', '아펜핀셔', '아프간 하운드', '알래스칸 맬러뮤트', '에스트렐라 마운틴 독',
    '에어데일 테리어', '오스트레일리안 실키 테리어', '오스트레일리안 켈피', '오스트레일리언 셰퍼드', '오스트레일리언 캐틀 도그',
    '오스트레일리언 테리어', '오터 하운드', '올드 잉글리시 시프도그', '와이머라너', '와이어 폭스 테리어',
    '와이어헤어드 포인팅 그리펀', '요크셔 테리어', '웨스트 하이랜드 화이트 테리어', '웰시 스프링어 스패니얼', '웰시 코기',
    '웰시 테리어', '이비전 하운드', '이탤리언 그레이하운드', '잉글리시 세터', '잉글리시 스프링어 스패니얼',
    '잉글리시 코커 스패니얼', '잉글리시 토이 스패니얼', '잉글리시 폭스하운드', '자이언트 슈나우저', '재퍼니스 친',
    '저먼 셰퍼드', '저먼 쇼트헤어드 포인터', '저먼 와이어헤어드 포인터', '저먼 핀셔', '저먼 헌팅 테리어',
    '진돗개', '차우차우', '차이니스 샤페이', '차이니스 크레스티드', '체서피크 베이 레트리버',
    '치와와', '카디건 웰시 코기', '카발리에 킹 찰스 스패니얼', '컬리코티드 레트리버', '케리 블루 테리어',
    '케언 테리어', '케이넌 도그', '케이스혼트', '코몬도르', '코커 스패니얼',

    '코튼 드 툴리어', '콜리', '쿠바스', '클럼버 스패니얼', '토이 폭스 테리어',
    '티베탄 마스티프', '티베탄 스패니얼', '티베탄 테리어', '파라오 하운드', '파슨 러셀 테리어',
    '파피용', '퍼그', '페키니즈', '펨브록 웰시 코기', '포르투갈 워터 도그',
    '포메라니안', '포인터', '폴리시 롤런드 시프도그', '푸들', '푸미',
    '풀리', '풍산개', '프렌치 불도그', '프티 바세 그리퐁 방댕', '플랫코티드 레트리버',
    '플롯 하운드', '피니시 스피츠', '피레니안 마스티프', '피레니안 쉽독', '피레니언 셰퍼드',
    '필드 스패니얼', '해리어', '허배너스', '휘핏', '가면팜사향고양이',
    '검은고양이', '고기잡이고양이', '고양이', '고양이눈뱀', '노르웨이숲고양이',
    '데본렉스고양이', '라가머핀고양이', '라이코이고양이', '라팜고양이', '랙돌고양이',
    '러시안블루고양이', '마블고양이', '맹크스고양이', '먼치킨고양이', '메인쿤고양이',

    '모래고양이', '민스킨고양이', '발리네즈고양이', '버마고양이', '버만고양이',
    '버미즈고양이', '봄베이고양이', '붉은점고양이', '브리티시롱헤어고양이', '브리티시쇼트헤어고양이',
    '사향고양이', '새끼고양이', '샤트룩스고양이', '샴고양이', '셀커크렉스고양이',
    '소말리고양이', '솔꼬리유대고양이', '스노우슈고양이', '스코티시폴드고양이', '스핑크스고양이',
    '시베리아고양이', '싱가퓨라고양이', '아라비아들고양이', '아메리칸밥테일고양이', '아메리칸쇼트헤어고양이',
    '아메리칸와이어헤어고양이', '아메리칸컬고양이', '아비시니아고양이', '아시아황금고양이', '아프리카들고양이',
    '아프리카사향고양이', '아프리카황금고양이', '안데스고양이', '알락꼬리고양이', '야생고양이',
    '엑조틱쇼트헤어고양이', '영국들고양이', '오리엔탈고양이', '오시캣고양이', '웨이디고양이',
    '유대고양이', '유러피안버미즈고양이', '유럽들고양이', '이그저틱고양이', '이집션마우고양이',
    '자바니즈고양이', '재패니즈밥테일고양이', '정글고양이', '주머니고양이', '집고양이',

    '컬러포인트쇼트헤어고양이', '코니시렉스고양이', '코랫고양이', '큰고양이', '터키시반고양이',
    '터키시앙고라고양이', '토이거고양이', '통키니즈고양이', '팔라스고양이', '팜파스고양이',
    '페르시아고양이', '페르시안고양이', '픽시밥고양이', '하바나브라운고양이', '히말라야고양이',
    '가뢰', '가리비', '가마새', '가면부비', '가면올빼미',
    '가문비뇌조', '가물치', '가분살모사', '가시고기류', '가시꼬리왕도마뱀',
    '가시나비고기', '가시도마뱀', '가시두더지', '가시등도마뱀', '가시복',
    '가시올빼미', '가우어', '가위개미', '가재', '가재류',
    '가젤영양', '가지뿔영양', '가지산호', '가창오리', '가터얼룩뱀',
    '각시바다거북', '각시붕어', '갈겨니', '갈고리부리솔개', '갈기늑대',
    '갈기퍼핀', '갈기호저', '갈까마귀', '갈대실고기', '갈라관앵무',

    '갈라파고스강치', '갈라파고스라바해오라기', '갈라파고스물개', '갈라파고스붉은게', '갈라파고스펭귄',
    '갈매기', '갈매기류', '갈매기부리제비갈매기', '갈색나무뱀', '갈색머리앵무',
    '갈색머리흑조', '갈색물뱀', '갈색벌새', '갈색부전나비', '갈색사다새',
    '갈색아놀리', '갈색여우원숭이', '갈색은둔거미', '갈색진홍앵무', '갈색토히새',
    '갈색하이에나', '갈퀴볼락', '감돌고기', '감옥게', '감자바리',
    '갑오징어', '강거북', '강꼬치고기', '강도래', '강돼지',
    '강송어', '강아지', '강준치', '개', '개개비',
    '개구리', '개구리매', '개구리입쏙독새', '개리', '개미',
    '개미핥기', '개연어', '개코원숭이', '갯민숭달팽이', '갯첨서',
    '갱갱관앵무', '거꾸로여덟팔나비', '거농원숭이', '거미', '거미고둥',

    '거미원숭이', '거북', '거북복어', '거울잉어', '거위',
    '건디', '검댕주홍부전나비', '검독수리', '검둥오리', '검둥오리사촌',
    '검둥원숭이', '검룡(劍龍)', '검은가면모란앵무', '검은고함원숭이', '검은과부거미',
    '검은군부', '검은꼬리멧토끼', '검은꼬리사슴', '검은꼬리암초상어', '검은꼬리왈라비',
    '검은눈방울새', '검은눈썹신천옹', '검은다람쥐', '검은다리실베짱이', '검은담비',
    '검은대머리수리', '검은댕기해오라기', '검은등갈매기', '검은등제비갈매기', '검은머리갈매기',
    '검은머리꼬리감기원숭이', '검은머리물떼새', '검은머리밀화부리', '검은머리박새', '검은머리방울새',
    '검은머리비단뱀', '검은머리신천옹', '검은머리흰죽지', '검은멧새', '검은모자앵무',
    '검은목논병아리', '검은목뱀', '검은바람까마귀', '검은발신천옹', '검은발족제비',
    '검은배유구오리', '검은뺨벌새', '검은수염고래', '검은여우원숭이', '검은장수앵무',

    '검은전복', '검은제비갈매기', '검은죽지솔개', '검은진홍앵무', '검은채찍뱀',
    '검은코뿔소', '검은토끼박쥐', '검은표범', '검정꼬리방울뱀', '검정밤고동',
    '검정방울뱀', '검정서부돼지코뱀', '검정쥐잡이뱀', '검정지느러미상어', '검정지빠귀',
    '검정카이만', '검정피그미방울뱀', '검정해삼', '검정황소뱀', '검치호랑이',
    '게', '게거미', '게아재비', '게잡이여우', '게잡이원숭이',
    '경산호', '고기잡이거미', '고기잡이박쥐', '고깔해파리', '고니',
    '고대고래', '고드맨살모사', '고라니', '고래', '고래상어',
    '고래새', '고려풀매미', '고리무늬도롱뇽', '고리부리갈매기', '고릴라',
    '고메라큰도마뱀', '고방오리', '고삐펭귄', '고슴도치', '고추좀잠자리',
    '고치벌과', '고퍼', '고퍼거북', '고핀관앵무', '고함원숭이',

    '곤들매기', '곤충', '골디진홍앵무', '골리앗왜가리', '골리앗창뿔풍뎅이',
    '곰', '곰쥐', '곰치', '공룡', '공작',
    '공작나비', '공작물총새', '공작비둘기', '공작비둘기류', '공작태양새',
    '과나코', '과달루페물개', '과일비둘기', '관두루미', '관머리비오리',
    '관박쥐', '관앵무새', '관여우원숭이', '관해면', '광대노린재',
    '광대새우', '광대파랑쥐치', '광주리해면', '괭이갈매기', '구관조',
    '구렁이', '구리머리살모사', '구리머리에메랄드벌새', '구피', '국자가리비',
    '군대개미', '군대앵무', '군주나비', '군청진홍앵무', '군함조',
    '굴', '굴드왕도마뱀', '굴뚝새', '굴뚝제비', '굴로',
    '굵은다리병대벌레', '굵은부리위버', '굽은뿔오릭스', '굿펠로우나무타기캥거루', '귀뚜라미',

    '귀뿔논병아리', '귀상어', '귀신고기', '귀제비', '그랜트가젤',
    '그랜트얼룩말', '그레비얼룩말', '그레이터쿠두', '그레이트데인', '그레이하운드',
    '그리슨족제비', '그물무늬기린', '근동살모사', '글자아라카리왕부리', '금강모치',
    '금강산코박쥐', '금강앵무', '금개구리', '금게', '금계(金鷄)',
    '금노린재', '금붕어', '금사후', '금테비단벌레', '금화조',
    '기가노토사우루스', '기러기', '기린', '기본원숭이', '긴귀주머니오소리',
    '긴꼬리도둑갈매기', '긴꼬리족제비', '긴꼬리홍양진이', '긴노린재류', '긴목거북',
    '긴발쥐캥거루', '긴발톱멧새', '긴발톱할미새', '긴부리꼬치고기', '긴부리마도요',
    '긴뿔소', '긴수염꼬마새우', '긴점박이올빼미', '긴코가시두더지', '긴코너구리',
    '긴코바구미', '긴코악어', '긴코주머니오소리', '긴코쥐캥거루', '긴털족제비',

    '길달리기새', '길잡이매', '깃꼬리유대하늘다람쥐', '깃대볼락', '까마귀',
    '까마귀류', '까막딱다구리', '까치', '까치류', '까치살모사',
    '깔때기그물거미', '깡충거미', '깡충살모사', '꺅도요', '꺽정이',
    '꺽지', '꼬까도요', '꼬리감기원숭이', '꼬마물떼새', '꼬마새우과',
    '꼬치고기', '꽃등에', '꽃병해면', '꾀꼬리', '꾀꼬리류',
    '꾸정모기', '꿀꺽장어', '꿀먹이박쥐', '꿀벌', '꿀빨이새',
    '꿩', '꿩류', '꿩앵무', '끝빨간긴날개멸구', '나나니',
    '나무거북', '나무늘보', '나무뒤쥐', '나무발발이', '나무좀',
    '나무타기캥거루', '나뭇잎고기', '나뭇잎실고기', '나방', '나비',
    '나비고기', '나비고기과', '나선계단고둥', '나일리치위영양', '나일악어',

    '나일왕도마뱀', '나팔수큰고니', '낙원두루미', '낙지', '낙타',
    '난장이거위', '난장이구라미', '난장이몽구스', '난장이뱀', '난장이참새',
    '난장이펭귄', '날개다랑어', '날개띠좀잠자리', '날개석공조개', '날개쥐치',
    '날다람쥐', '날도래', '날쥐', '남극물개', '남방공작나비',
    '남방노랑나비', '남방바다사자', '남부목고리뱀', '남부붉은등도롱뇽', '남부표범개구리',
    '남생이', '남생이류', '남아메리카물개', '남아프리카대머리따오기', '남아프리카물개',
    '남쪽풀색노린재', '남태평양큰도마뱀붙이', '납솔개', '납자루', '납작머리청개구리',
    '납지리', '내소바리', '너구리', '넉줄꽃하늘소', '넓적꼬리벌새',
    '넓적꼬리찌르레기사촌', '넓적날개말똥가리', '넓적부리', '넓적부리벌새', '넓적부리홍저어새',
    '넓적부리황새', '네뿔영양', '네온망둥어', '네온양놀래기', '네줄물퉁돔',

    '넬슨영양땅다람쥐', '노란가슴찌르레기', '노란관앵무', '노란눈살모사', '노란눈썹펭귄',
    '노란눈펭귄', '노란등진홍앵무', '노란머리버들솔새', '노란머리아마존앵무', '노란머리왕도마뱀',
    '노란머리큰박쥐', '노란목덜미땅다람쥐', '노란목덜미아마존앵무', '노란목휘파람새', '노란발갈매기',
    '노란발개구리', '노란배단풍새', '노란배딱새', '노란배마모트', '노란배수액빨이딱다구리',
    '노란뺨솔새', '노란뺨아마존앵무', '노란뺨찌르레기', '노란아나콘다', '노란이마딱다구리',
    '노란탱', '노랑가슴앵무', '노랑꼬리물퉁돔', '노랑꼬리자리돔', '노랑나비류',
    '노랑때까치', '노랑띠하늘소', '노랑머리흑조(黑鳥)', '노랑발유대쥐', '노랑배거북',
    '노랑배족제비', '노랑부리뻐꾸기', '노랑부리저어새', '노랑부리저어새류', '노랑부리흑조',
    '노랑애기나방', '노랑키조개', '노랑턱멧새', '노랑허리다이커', '노랑황금두더지',
    '노래기', '노루', '노린재', '노새', '논병아리',

    '논병아리류', '농게', '뇌룡', '뇌조', '누',
    '누에', '누치', '눈신멧토끼', '눈토끼', '뉴기니아거북',
    '뉴질랜드검은머리흰죽지', '뉴질랜드물개', '뉴질랜드울새', '뉴칼레도니아가고일도마뱀붙이', '느림보늘보원숭이',
    '늑대', '늑대거미', '늑대거북', '늑대거북류', '늑대고기',
    '늑대류', '늘보곰', '늘보원숭이', '늘보주머니쥐', '늪거북',
    '늪굴뚝새', '늪살모사', '늪영양', '니얄라', '니코바땅비둘기',
    '닐가이영양', '다람쥐', '다람쥐류', '다람쥐원숭이', '다람쥐청개구리',
    '다마가젤', '다마사슴', '다섯수염대구', '다섯줄도마뱀', '다슬기',
    '다윈코개구리', '다윈큰귀생쥐', '다이아몬드거북', '다이아몬드고기', '다이아몬드물뱀',
    '다이아몬드방울뱀', '다이온쥐잡이뱀', '다이커영양', '닥스훈트', '단봉낙타',

    '달고기', '달랑게', '달마시안', '달팽이', '달팽이류',
    '달팽이솔개', '닭', '닭새우', '담비', '담색물잠자리',
    '담색어리표범나비', '당나귀', '당닭', '대눈파리', '대륙나무뒤쥐',
    '대륙담비', '대리석거미', '대리석도롱뇽', '대리석참바리', '대만파랑까치',
    '대머리따오기', '대벌레류', '대서양검정망둑', '대서양청복', '대서양파란탱',
    '대서양활치', '대유동방아벌레', '대합', '댕기물떼새', '댕기박새',
    '댕기벌새', '댕기흰죽지', '더글라스다람쥐', '덤불어치', '데구',
    '데이노니쿠스', '데이지산호', '도가머리딱다구리', '도가머리뻐꾸기', '도가머리투라코뻐꾸기',
    '도롱뇽', '도마뱀', '도마뱀류', '도마뱀붙이', '도시처녀나비',
    '도요새', '도치', '도토리딱다구리', '독개구리', '독거미',

    '독수리', '독수리류', '독일셰퍼드', '돌거북', '돌고기',
    '돌고래', '돌묵상어', '돌산양', '돌조개', '동고비',
    '동박새', '동박새과', '동방솜꼬리큰토끼', '동부다이아몬드방울뱀', '동부돼지코뱀',
    '동부띠뱀', '동부범도롱뇽', '동부상자거북', '동부왕뱀', '동부우유뱀',
    '동부지렁이뱀', '동부진흙거북', '동부파랑지빠귀', '동사리', '동아프리카관두루미',
    '동자개', '돛새치', '돛새치류', '돼지', '돼지돔',
    '돼지사슴', '돼지코뱀', '돼지코자라', '되새', '되새류',
    '두건바다표범', '두꺼비', '두꺼비과', '두꺼비벌레', '두더지',
    '두더지도롱뇽', '두더지류', '두더지붙이쥐', '두동가리돔', '두루미',
    '두루미류', '두머리비단뱀', '두뿔거북복', '두우쟁이', '두크마른원숭이',

    '뒤쥐', '뒷부리장다리물떼새', '뒷부리장다리물떼새류', '듀공', '들꿩',
    '들오리', '들종다리', '등각류(等脚類)', '등에', '등줄쥐',
    '등지느러미도마뱀', '디메트로돈', '디플로도쿠스', '딕딕영양', '딜로포사우루스',
    '딩고', '따개비', '따오기', '딱다구리', '딱새',
    '딱새류', '딱정벌레', '딱지조개', '땅늑대', '땅돼지',
    '땅벌나방', '땅비둘기', '땅비둘기류', '떡갈잎풍뎅이', '떼까마귀',
    '뜀토끼', '뜸부기', '띠꼬리솔개', '띠뱀', '띠호박벌',
    '라마', '라이거', '라일락아마존앵무', '라피네스크토끼박쥐', '래브라도리트리버',
    '레몬상어', '레밍', '레서쿠두', '레이산신천옹', '로데시안리지백',
    '로얄그라마', '로키산양', '로트와일러개', '론영양', '루셀쏠배감펭',

    '루시퍼벌새', '루펠대머리수리', '룰룰반시(半翅)', '리드벅', '리스트',
    '리트리버', '마다가스카르나뭇잎도마뱀붙이', '마다가스카르도마뱀붙이', '마다가스카르땅도마뱀붙이', '마다가스카르안경돼지코뱀',
    '마다가스카르초록도마뱀붙이', '마다가스카르큰돼지코뱀', '마다가스카르푸른도마뱀붙이', '마데이라망둑', '마데이라벽타기도마뱀',
    '마도요', '마도요류', '마른원숭이', '마리아나과일비둘기', '마리아나큰박쥐',
    '마모셋원숭이', '마모트', '마샬수리', '마젤란거위', '마젤란펭귄',
    '마카로니펭귄', '마카크원숭이', '마코앵무', '마타마타거북', '만드릴비비',
    '만새기', '말', '말굽채찍뱀', '말똥가리', '말똥구리',
    '말뚝망둥어', '말레이곰', '말레이맥', '말매미', '말미잘',
    '말미잘게', '말미잘산호', '말미잘새우', '말벌', '말전복',
    '말총벌', '말코손바닥사슴', '말파리', '맘모스', '맘바',

    '망그루브왕도마뱀', '망둥어', '망치머리해오라기', '망토개코원숭이', '매',
    '매가오리과', '매류', '매미', '매미충', '매부리거북',
    '매치나무타기캥거루', '맥', '맥시밀리안거북', '맹꽁이', '머리',
    '먹그림나비', '먹주홍하늘소', '먹황새', '멋장이나비', '멋쟁이',
    '메기', '메기류', '메뚜기', '메렌스살모사', '메추라기',
    '메추라기닭', '멕시코늑대', '멕시코비단뱀', '멕시코악어', '멕시코양진이',
    '멕시코초원매', '멕시코파랑지빠귀', '멜바단풍새', '멧닭', '멧돼지',
    '멧밭쥐', '멧비둘기', '멧새', '멧새과', '며느리발톱거북',
    '명주쥐', '모기', '모기잡이', '모란앵무', '모래무지',
    '모래보아', '모래톱고기', '모자민어', '모하베방울뱀', '목걸이흰비둘기',

    '목고리뱀', '목도리댕기흰죽지', '목도리아라카리왕부리', '목무늬도마뱀', '목수개미',
    '목화쥐', '몽고마', '몽구스', '몽구스류', '몽구스여우원숭이',
    '무늬개오지', '무당개구리', '무당벌레', '무른갑가시자라', '무스',
    '무지개꿩', '무지개벌잡이새', '무지개보아', '무지개송어', '무지개아마존앵무',
    '무지개양놀래기', '무지개진홍앵무', '무플론산양', '묵납자루', '문어',
    '문착', '물개', '물고기', '물까치', '물닭',
    '물도마뱀', '물두꺼비', '물떼새', '물방개', '물밭쥐',
    '물뱀', '물빛긴꼬리부전나비', '물수리', '물영양', '물자라',
    '물쥐', '물지빠귀', '물총고기', '물총새', '물총새류',
    '물코브라', '물퉁돔', '뮬가앵무', '미국개고마리', '미국까치상어',

    '미국늪거북', '미국대분지쟁기발개구리', '미국쇠오리', '미국수염상어', '미국왕귀뚜라미',
    '미국초록개고마리', '미국호랑거미', '미시시피솔개', '미시시피악어', '미시시피지도거북',
    '미어캣', '민달팽이', '민달팽이류', '민물가마우지', '민물가오리',
    '민물수달', '민어과', '밀화부리', '밀화부리류', '밍크',
    '밑드리메뚜기', '바구미', '바다가재', '바다거머리', '바다거북',
    '바다검둥오리사촌', '바다꿩', '바다나리류', '바다뱀', '바다비오리',
    '바다사자', '바다사자류', '바다소', '바다쇠오리', '바다수달',
    '바다악어', '바다오리', '바다전갈', '바다제비', '바다조름',
    '바다채찍산호', '바다코끼리', '바다표범', '바둑돌부전나비', '바람까마귀',
    '바바리반시(半翅)', '바바리양', '바바리원숭이', '바바쿠트', '바브',

    '바비루사멧돼지', '바셋하운드', '바실로사우르스', '바위너구리', '바위뇌조',
    '바위새', '바위이구아나', '바위타기영양(羚羊)', '바지락', '바퀴벌레',
    '바하마고방오리', '바하마보아', '바하마후티아', '박각시나방', '박새',
    '박새류', '박쥐', '박쥐귀여우', '반달곰', '반달바다표범',
    '반시(半翅)', '반양(盤羊)', '반짝이벌새', '반텡', '발리흰찌르레기',
    '밤조개', '밥캣스라소니', '방사쏠배감펭', '방아벌레', '방울뱀',
    '방울새', '밭쥐', '배스', '배추흰나비', '백로',
    '백마(白馬)', '백변종(白變種)', '백사자', '백상어', '백조',
    '백호', '뱀', '뱀가마우지', '뱀장어', '뱀허물쌍살벌',
    '뱅쿠버마모트', '버들개', '버들붕어', '버들솔새', '버들치',

    '버마비단뱀', '벅하운드', '벌', '벌거숭이두더지쥐', '벌레',
    '벌새', '벌잡이부치새', '벌잡이새', '벌잡이새사촌', '벌잡이새사촌과',
    '범고래', '범도롱뇽', '범상어', '범쥐잡이뱀', '베게이터파리매',
    '베네주엘라붉은배청타란튤라', '베네트나무타기캥거루', '베네트붉은목왈라비', '베도라치류', '베르베트원숭이',
    '베짜기되새', '베짱이', '벵골왕도마뱀', '벵골호랑이', '벼룩',
    '별코두더지', '볏나무도마뱀', '볏도마뱀', '볏뿔닭', '병아리',
    '병코돌고래', '보라색비단뱀', '보라색주홍부전나비', '보라성게', '보라큰털발제비',
    '보르네오붉은비단뱀', '보르조이', '보리나방살이고치벌', '보리새우', '보스톤테리어',
    '보아', '보이드나무도마뱀', '복서', '본테복', '볼락류',
    '봉고', '부비', '부시벅', '부안종개', '부전나비류',

    '부채꼬리뇌조', '부채꼬리쥐치', '부채산호', '부채휘파람새', '북극곰',
    '북극도둑갈매기', '북극여우', '북극이리', '북방가넷', '북방개구리매',
    '북방난쟁이청개구리', '북방물개', '북방바다사자', '북방보라금풍뎅이', '북방쇠찌르레기',
    '북방올빼미', '북방초원하늘소', '북방코쟁이바다표범', '북방흰뺨오리', '북부목고리뱀',
    '북서가터얼룩뱀', '북아메리카검은머리흰죽지', '북아메리카마모트', '북아메리카호저', '분홍가슴파랑새',
    '분홍거미고둥', '분홍관앵무', '분홍발톱타란튤라', '불가사리', '불곰',
    '불꽃가슴벌새', '불꽃올빼미', '불독', '불테리어', '붉은가면앵무',
    '붉은가슴기러기', '붉은가슴밀화부리', '붉은가슴벌새', '붉은가슴수액빨이딱다구리', '붉은가슴울새',
    '붉은가슴잎벌레', '붉은가시얼게돔', '붉은고함원숭이', '붉은관앵무', '붉은긴노린재',
    '붉은까불나비', '붉은꼬리검정관앵무', '붉은꼬리망상어', '붉은꼬리매', '붉은꼬리메기',

    '붉은꼬리물오리', '붉은꼬리보아', '붉은나무박쥐', '붉은눈직박구리', '붉은눈청개구리',
    '붉은다람쥐', '붉은다람쥐류', '붉은다이아몬드방울뱀', '붉은등검정거미', '붉은등놀래기',
    '붉은등도롱뇽', '붉은등밭쥐', '붉은따오기', '붉은매', '붉은머리꿀빨이새',
    '붉은머리독개구리', '붉은머리딱다구리', '붉은머리오목눈이', '붉은머리쥐잡이뱀', '붉은목도리벌새',
    '붉은목도리여우원숭이', '붉은목숲왈라비', '붉은목카라카라', '붉은바다거북', '붉은박쥐',
    '붉은발도요', '붉은발부비', '붉은발슴새', '붉은발타란튤라', '붉은배검정뱀',
    '붉은배딱다구리', '붉은배여우원숭이', '붉은백로', '붉은벌잡이새', '붉은벼슬딱다구리',
    '붉은벼슬흰죽지', '붉은볼락', '붉은부리갈매기', '붉은부리고니', '붉은부리고방오리',
    '붉은부리뱀', '붉은부리회색갈매기', '붉은부리흰죽지', '붉은비단뱀', '붉은뺨검정야자관앵무',
    '붉은뺨단풍새', '붉은뺨모란앵무', '붉은새우', '붉은쇠오리', '붉은숲쥐',

    '붉은양진이', '붉은어깨도요', '붉은어깨수리', '붉은여우', '붉은옆구리검은멧새',
    '붉은옆줄가터얼룩뱀', '붉은왕뱀', '붉은이리', '붉은이마부채꼬리', '붉은이마아마존앵무',
    '붉은이마앵무', '붉은점모시나비', '붉은줄망둥어', '붉은줄보아', '붉은진홍앵무',
    '붉은참매', '붉은팬더', '붉은풍금새', '붉은피그미방울뱀', '붉은홍관조',
    '붉전갱이', '붕어', '뷰익굴뚝새', '브라질둥지개구리', '브라질뿔개구리',
    '브라키오사우루스', '블랙번솔새', '블랜포드여우', '블레스복', '블루길',
    '비글사냥개', '비늘돔류', '비단거북', '비단뱀', '비단벌레과',
    '비단원숭이', '비단잉어', '비단풍금새', '비둘기', '비둘기바다제비',
    '비명올빼미', '비버', '비성비둘기', '비숑프리제', '비스카차',
    '비오리', '비오리류', '비쿠냐', '비행', '빈투롱',

    '빨간점도화새우', '뻐꾸기', '뻐꾸기류', '뾰족꼬리사막꿩', '뿔개구리',
    '뿔논병아리', '뿔닭', '뿔도마뱀', '뿔살모사', '뿔쥐치',
    '뿔퍼핀', '뿔호반새', '뿔호반새류', '삑삑도요', '사다리줄무늬딱다구리',
    '사다새', '사랑앵무', '사마귀', '사마귀과', '사마귀멧돼지',
    '사막거북', '사막꿩', '사막꿩류', '사막방울뱀', '사막솜꼬리큰토끼',
    '사막여우', '사막왕뱀', '사막채찍뱀', '사모예드', '사목나비고기',
    '사바나왕도마뱀', '사슴', '사슴벌레', '사슴벌레류', '사슴쥐',
    '사슴풍뎅이', '사이가영양', '사자', '사자꼬리마카크원숭이', '사탕새우',
    '사프란쇠왕부리', '사할린뇌조(雷鳥)', '사향노루', '사향소', '산길앞잡이',
    '산꼬마까마귀부전나비', '산네발나비', '산니얄라', '산달', '산양',

    '산제비나비', '산족제비', '산좀잠자리', '산천어', '산토끼',
    '산파랑지빠귀', '산호', '산호랑나비', '산호뱀', '살기',
    '살모사', '살찐꼬리난장이여우원숭이', '살찐꼬리여우원숭이', '삵', '삼각룡(三角龍)',
    '삼광조', '삼바사슴', '삼발이고기', '삼색독개구리', '삼색왜가리',
    '삼색제비', '삼색천사고기', '삼엽충', '삼천발이', '삽살개',
    '상딱새', '상사줄자돔', '상상의동물', '상어', '상자거북',
    '새', '새끼돼지', '새끼사슴', '새끼양', '새매',
    '새매류', '새미', '새소리청개구리', '새앙토끼', '새우',
    '새치', '새코미꾸리', '생쥐', '샤므와', '서방회색다람쥐',
    '서벌스라소니', '서부갈매기', '서부논병아리', '서부다이아몬드방울뱀', '서부돼지코뱀',

    '서부방울뱀', '서부상자거북', '서부쟁기발개구리', '서부줄무늬도마뱀붙이', '서아프리카관두루미',
    '선인장굴뚝새', '설표(雪豹)', '섬참새', '성게', '세가락갈매기',
    '세네갈비둘기', '세띠아르마딜로', '세미놀박쥐', '세미서클엔젤피시', '세바스토폴리거위',
    '세발가락개미핥기', '세발가락나무늘보', '세인트버나드', '세줄진흙거북', '세크로피아나방',
    '셰트랜드쉽도그', '셰퍼드', '소', '소금쟁이', '소나무산달',
    '소노라고퍼뱀', '소노라산왕뱀', '소라게', '소새', '소쩍새',
    '속눈썹살모사', '솔개', '솔개류', '솔로몬에메랄드도마뱀', '솔밀화부리',
    '솔새', '솔잎혹파리', '솔잣새', '솜꼬리큰토끼', '솜머리비단원숭이',
    '솜털딱다구리', '솜털오리', '송골매', '송어', '송어류',
    '송장개구리', '송장헤엄치게', '쇠개개비', '쇠고래', '쇠기러기',

    '쇠꼬리벌새', '쇠나무뒤쥐', '쇠노란관앵무', '쇠뜸부기', '쇠뜸부기사촌',
    '쇠물닭', '쇠물닭류', '쇠백로', '쇠벌잡이새', '쇠부리딱다구리',
    '쇠부리솔개', '쇠부리슴새', '쇠부엉이', '쇠오리', '쇠오리류',
    '쇠왕부리', '쇠재두루미', '쇠제비갈매기', '쇠찌르레기', '쇠혹물떼새',
    '쇠홍학', '쇠황금방울새', '쇠황조롱이', '쇳빛부전나비', '수계(綏鷄)',
    '수달', '수달류', '수리', '수리남관왜가리', '수리부엉이',
    '수마트라코뿔소', '수마트라호랑이', '수액빨이딱다구리', '수염고래', '수염바다표범',
    '수염수리', '수염오색조', '수장룡', '수정조개', '수탉',
    '수확쥐', '순록', '숲개', '숲왈라비', '숲지빠귀',
    '숲황새', '쉬나이더난장이카이만', '쉬리', '스라소니', '스라소니거미',

    '스라소니류', '스웨인슨매', '스웨인슨왕부리', '스위프트여우', '스컹크',
    '스컹크청소새우', '스콰코해오라기', '스쿠터', '스키퍼키', '스킹크도마뱀',
    '스타인복', '스텔러어치', '스파니엘', '스페인스라소니', '스프링복',
    '스피팅코브라', '스픽스마코앵무', '슴새과', '시드니깔때기그물거미', '시베리아어치',
    '시베리아줄무늬다람쥐', '시베리아호랑이', '시베리아흰두루미', '시조새(始祖새)', '시카사슴',
    '시클리드', '시파카원숭이', '시피오닉스', '식분어(食糞魚)', '신천옹',
    '신천옹류', '실고기', '실꼬리벌새', '실날개풀잠자리', '실라칸스',
    '실지렁이', '심해도끼고기', '심해새우', '심해어', '심홍가슴숲별벌새',
    '심홍부전나비', '심홍장미앵무', '쌀먹이새', '쌍띠물떼새', '쌍봉낙타',
    '쌍살벌류', '쏘가리', '쏠배감펭', '쐐기꼬리수리', '씬벵이류',

    '아가마도마뱀', '아구티', '아귀', '아나콘다', '아내쥐치',
    '아놀리', '아델리펭귄', '아라비아오릭스', '아라카리왕부리', '아르리카연각(蓮角)',
    '아르마딜로', '아르헨티나뿔개구리', '아르헨티나파란부리오리', '아리엘왕부리', '아리조나악어도마뱀',
    '아마존나무보아', '아마존돌고래', '아마존앵무', '아메리카가재', '아메리카검은댕기해오라기',
    '아메리카검은멧토끼', '아메리카까마귀', '아메리카꾀꼬리', '아메리카너구리', '아메리카담비',
    '아메리카독도마뱀', '아메리카두꺼비', '아메리카뒷부리장다리물떼새', '아메리카들소', '아메리카딱새',
    '아메리카매미', '아메리카맥', '아메리카멧토끼', '아메리카물떼새', '아메리카불곰',
    '아메리카붉은가슴울새', '아메리카붉은다람쥐', '아메리카뿔호반새', '아메리카새우', '아메리카솔새',
    '아메리카쇠백로', '아메리카쇠쏙독새', '아메리카쇠족제비', '아메리카수달', '아메리카쏙독새',
    '아메리카아니뻐꾸기', '아메리카악어', '아메리카알락해오라기', '아메리카어치', '아메리카오소리',

    '아메리카원앙', '아메리카쥐잡이뱀', '아메리카큰곰', '아메리카풀거북', '아메리카홍머리오리',
    '아메리카황새', '아메리카황조롱이', '아메리카휘파람새', '아메리카흰죽지', '아메바',
    '아무르불가사리', '아무르쥐잡이뱀', '아비', '아비류', '아비시니아코뿔새',
    '아스트란지아산호', '아시아당나귀', '아시아무플론산양', '아시아물소', '아시아사자',
    '아시아실잠자리', '아시아알락찌르레기', '아시아호저', '아시아황금들개', '아이벡스',
    '아이아이', '아즈텍개미', '아키타개', '아킬레스탱', '아프리카고기잡이수리',
    '아프리카난장이악어', '아프리카늘보원숭이', '아프리카늘보원숭이류', '아프리카두더지뱀', '아프리카들개',
    '아프리카따오기', '아프리카말똥가리', '아프리카무수리', '아프리카물소', '아프리카발톱개구리',
    '아프리카붉은뺨수리', '아프리카비단뱀', '아프리카뿔호반새', '아프리카사막꿩', '아프리카살모사',
    '아프리카살쾡이', '아프리카삼광조', '아프리카새매', '아프리카소쩍새', '아프리카숲살모사',

    '아프리카오소리', '아프리카찌르레기', '아프리카코끼리', '아프리카코뿔새', '아프리카코뿔새류',
    '아프리카큰느시', '아플로마도송골매', '아홉띠아르마딜로', '악어', '악어거북',
    '악어꼬치고기', '악어도마뱀붙이', '악어새', '악어왕도마뱀', '안경곰',
    '안경원숭이', '안경주걱치', '안경카이만', '안나벌새', '안데스대머리수리',
    '안데스바위새', '안티포디즈초록앵무', '알다브라코끼리거북', '알라바마지도거북', '알락꼬리마도요',
    '알락꼬리여우원숭이', '알락딱새', '알락뜸부기', '알락오리', '알락할미새',
    '알래스카개굴', '알래스카불곰', '알렌토끼박쥐', '알로사우루스', '알파카',
    '암모나이트', '암퇘지', '앙고라토끼', '애기금눈올빼미', '애기불가사리',
    '애기사슴', '애기세줄나비', '애기여새', '애기캥거루', '애긴다리풍뎅이',
    '애닥스영양', '애로와나', '애벌레', '애트워터초원뇌조', '액솔로틀',

    '앨버트사우루스', '앵무새', '앵무조개', '야생칠면조', '야자관앵무',
    '야크', '양', '양놀래기', '양비둘기', '양서류',
    '양자강악어', '양진이', '양털원숭이', '어름치', '어리표범나비',
    '어리호박벌', '어치', '어치류', '어포섬', '얼굴',
    '얼룩검은멧새', '얼룩돌고래', '얼룩동사리', '얼룩말', '얼룩말나비',
    '얼룩말나비류', '얼룩말상어', '얼룩무늬도마뱀', '얼룩바다표범', '얼룩부리논병아리',
    '얼룩상어', '얼룩스컹크', '얼룩쥐새', '얼룩청소새우', '얼룩코거농',
    '에르켈자고새', '에메랄드나무보아', '에메랄드물잠자리', '에뮤', '에스키모개',
    '에어데일테리어', '에콰도르분홍발톱타란튤라', '에콰도르산왕부리', '엔사티나도롱뇽', '여름풍금새',
    '여새', '여섯띠아르마딜로', '여왕개미', '여왕나비', '여왕천사고기',

    '여왕파랑쥐치', '여우', '여우다람쥐', '여우류', '여우뱀',
    '여우원숭이', '연각(蓮角)', '연꽃성게', '연미복밀화부리', '연어',
    '열대방울뱀', '열대새', '열대어', '열목어', '열세줄땅다람쥐',
    '염소', '염소류', '영국말벌', '영국붉은다람쥐', '영국양치기개',
    '영양(羚羊)', '영양땅다람쥐', '영원', '영지씬벵이', '예쁜이새우',
    '오랑우탄', '오레곤엔사티나도롱뇽', '오리', '오리너구리', '오리류',
    '오리비', '오릭스', '오목눈이', '오비랩터', '오색머리콘도르',
    '오색멧새', '오색솜털오리', '오색엔사티나도롱뇽', '오색조', '오셀롯스라소니',
    '오소리', '오소리류', '오스카', '오징어', '오카피',
    '옥수수멧새', '옥수수뱀', '올리브각시바다거북', '올림픽도롱뇽', '올빼미',

    '올빼미원숭이', '올챙이', '와투시긴뿔소', '왕관앵무', '왕도롱이나방',
    '왕도마뱀', '왕뜸부기', '왕뱀', '왕뱀류', '왕부리',
    '왕비단뱀', '왕사마귀', '왕앵무', '왕연어', '왕오색나비',
    '왕잠자리', '왕줄나비', '왕치타', '왕팔랑나비', '왜가리',
    '왜가리류', '왜문어', '용(龍)', '우렁이', '우아카리',
    '우유뱀', '운표(雲豹)', '울도하늘소', '울새류', '움직이는그림',
    '웃음갈매기', '웃음물총새', '웃음물총새류', '원숭이', '원앙',
    '원우(原牛)', '웜뱃', '웜뱃류', '윌리암슨수액빨이딱다구리', '유구오리',
    '유니콘', '유대하늘다람쥐', '유럽갈색새우', '유럽개똥지빠귀', '유럽고슴도치',
    '유럽들소', '유럽떡갈잎풍뎅이', '유럽반시(半翅)', '유럽뱀장어', '유럽붉은가슴울새',

    '유럽붉은솔개', '유럽사슴벌레', '유럽스라소니', '유럽정원거미', '유럽집게벌레',
    '유럽집박쥐', '유럽청개구리', '유럽큰꾸정모기', '유럽토끼', '유럽파랑새',
    '유럽황새', '유령박쥐', '유령실고기', '유령얼굴박쥐', '유리개구리',
    '유리나비', '유리멧새', '유타랩터', '유혈목이', '육점망둥어',
    '융단비단뱀', '은계(銀鷄)', '은발박쥐', '은연어', '은점표범나비',
    '은지느러미상어', '은털박쥐', '응애', '이구아나', '이베리아바위도마뱀',
    '이빨고동', '이빨솔개', '이집트기러기', '이집트대머리수리', '이집트코브라',
    '익룡(翼龍)', '인도네시아큰나방', '인도도깨비쥐', '인도별사슴', '인도비단뱀',
    '인도악어', '인도엘크사슴', '인도영양', '인도천산갑', '인도코끼리',
    '인도코브라', '인드리', '일런드영양', '일본납작진딧물', '일본산양',

    '일본원숭이', '임금펭귄', '임팔라', '잉어', '잉카비둘기',
    '잉카제비갈매기', '잎벌레', '자고새', '자라류', '자메이카딱다구리',
    '자바공작', '자바코뿔소', '자이르다이커', '자주색갯민숭달팽이', '자주색태양새',
    '자줏빛가슴보석벌새', '작살머리방울뱀', '작은갈색박쥐', '작은검정가면올빼미', '작은멋쟁이나비',
    '작은발톱수달', '작은입벤자리', '작은쥐여우원숭이', '작은청왜가리', '작은초원뇌조',
    '작은황조롱이', '잠자리', '잣까마귀', '장구애비', '장난꾸러기',
    '장님거미', '장다리물떼새', '장다리물떼새류', '장미앵무', '장수가재',
    '장수거북', '장수말벌', '장수하늘소', '재갈매기', '재규어',
    '재두루미', '재첩', '재카스펭귄', '재칼', '재칼류',
    '잿빛까마귀', '잿빛쇠찌르레기', '쟁기발개구리', '쟁기발개구리과', '저녁멧새',

    '저녁박쥐', '저어새', '전갈', '전기뱀장어', '전복',
    '전어', '점박이거북복', '점박이도롱뇽', '점박이딱새', '점박이붉바리',
    '점박이올빼미', '점박이왕뱀', '점박이하이에나', '점부리쇠왕부리', '점쏠배감펭',
    '점지느러미쏠배감펭', '제레눅', '제비', '제비갈매기', '제비갈매기류',
    '제비꼬리벌잡이새', '제비꼬리솔개', '제비류', '젠데이태양앵무', '젠투펭귄',
    '젤라다비비', '조개', '조개삿갓', '조랑말', '조릴라스컹크',
    '조흰뱀눈나비', '족제비', '족제비류', '좀도요', '좀매미',
    '종다리', '종다리류', '주걱치류', '주름얼굴대머리수리', '주름코박쥐',
    '주머니긴팔원숭이', '주머니날다람쥐', '주머니두더지', '주머니여우', '주머니오소리',
    '주벅대치', '주벅대치류', '주사위뱀', '주홍부전나비류', '줄나비류',

    '줄따개비', '줄무늬꼬리비둘기', '줄무늬나비고기', '줄무늬농어', '줄무늬다람쥐',
    '줄무늬다이커', '줄무늬새매', '줄무늬스컹크', '줄무늬올빼미', '줄무늬유대개미핥기',
    '줄무늬탱', '줄무늬팔색조', '줄무늬하이에나', '줄비늘돔', '중대백로',
    '중백로', '중부리도요', '중새우', '중서부지렁이뱀', '중화용조(中華龍鳥)',
    '쥐', '쥐가오리', '쥐복', '쥐새', '쥐여우원숭이',
    '쥐잡이뱀', '쥐족제비', '쥐치', '쥐캥거루', '지네',
    '지느러미고래', '지도거북', '지도거북류', '지렁이', '지렁이뱀',
    '지빠귀류', '직박구리', '진돗개', '진드기', '진디',
    '진주솔개', '진주시클리드', '진홍가슴', '진홍나방', '진홍머리앵무',
    '진홍쇠물닭', '진홍앵무', '진홍테트라', '진흙뱀', '집게벌레',

    '집비둘기', '집쥐', '집참새', '청둥오리', '짧은꼬리땃쥐',
    '짧은꼬리수리', '짧은뿔메뚜기', '짧은코가시두더지', '찌르레기', '찌르레기과',
    '찌르레기사촌', '찌르레기사촌류', '차우차우', '차찰라카', '차크마비비',
    '참개구리', '참깨점박이바다표범', '참깽깽매미', '참돌고래', '참돔',
    '참마자', '참매', '참매미', '참문어', '참바리',
    '참붕어', '참새', '참새류', '참새올빼미', '참수리',
    '참재첩', '참종개', '참해삼', '채꼬리파랑새', '채찍꼬리도마뱀',
    '채찍뱀', '처크왈러', '천사고기', '천산갑(穿山甲)', '천인조',
    '천잠아(天蠶蛾)', '천축서', '철새까마귀', '철써기', '청개구리',
    '청개구리류', '청거북', '청남푸른부전나비', '청동찌르레기', '청동흑조',

    '청딱다구리', '청밀화부리', '청새리상어', '청새치', '청설모',
    '청소놀래기', '청솔새', '청왜가리', '청잎벌레', '청자고동',
    '청줄벤자리', '청호반새', '청황마코앵무', '초록개구리', '초록관밝은벌새',
    '초록난장이거위', '초록낫부리새', '초록도마뱀', '초록두꺼비', '초록바다거북',
    '초록뱀', '초록비단뱀', '초록뺨앵무', '초록스라소니거미', '초록아놀리',
    '초록아라카리왕부리', '초록앵무', '초록어치', '초록은둔벌새', '초록이구아나',
    '초록자주귀벌새', '초록청개구리', '초원뇌조', '초원목고리뱀', '초원왕뱀',
    '초파리', '총알고둥', '치와와', '치타', '치프차프솔새',
    '친칠라', '친칠라생쥐', '칠레물개', '칠레쥐', '칠면조',
    '칠면조수리', '칠성무당벌레', '칡부엉이', '침노린재', '침팬지',

    '카나리아', '카나리아제도검은코도마뱀', '카라카라', '카리브매퉁이', '카리브암초상어',
    '카멜레온', '카신양진이', '카이만악어', '카피바라', '칼납자루',
    '칼리오페벌새', '캐나다기러기', '캐나다두루미', '캐나다솔새', '캐나다스라소니',
    '캐롤라이나박새', '캐롤라이나사마귀', '캐롤라이나앵무', '캐롤라이나회색다람쥐', '캔틸살모사',
    '캘리포니아검은멧새', '캘리포니아다람쥐', '캘리포니아대머리수리', '캘리포니아산왕뱀', '캘리포니아왕뱀',
    '캘리포니아줄도롱뇽', '캥거루', '케라바우물소', '케아앵무', '케언테리어',
    '케이만큰바위이구아나', '케이프가넷', '케이프배런기러기', '케찰', '켐프각시바다거북',
    '코기', '코끼리', '코끼리거북', '코끼리땃쥐', '코란천사고기',
    '코리슴새', '코모도왕도마뱀', '코브라', '코뿔나비고기', '코뿔살모사',
    '코뿔새', '코뿔새류', '코뿔소', '코뿔이구아나', '코스타벌새',

    '코알라', '코요테', '코쟁이바다표범', '코주부원숭이', '코치쟁기발개구리',
    '코프회색나무개구리', '콘도르', '콜로부스원숭이', '콜리', '콜린메추라기',
    '콧등털웜뱃', '콩새', '콩중이', '콰가얼룩말', '쿠두',
    '쿠바아마존앵무', '쿠바악어', '쿠바초록앵무', '쿠바후티아', '쿠비어난장이카이만',
    '쿠스쿠스', '쿠카왈라비', '쿠터거북', '쿠퍼수리', '쿠프레들소',
    '쿤자연어', '퀘이커앵무', '크로노사우루스', '크산토스벌새', '큰가시고기',
    '큰갈색박쥐', '큰개미핥기', '큰거문고새', '큰고니', '큰귀박쥐',
    '큰귀생쥐', '큰기러기', '큰꼬리검은찌르레기사촌', '큰넙치', '큰논병아리',
    '큰뇌조(雷鳥)', '큰동면쥐', '큰들소', '큰멋쟁이나비', '큰민달팽이',
    '큰바다제비', '큰박쥐', '큰부리까마귀', '큰부리밀화부리', '큰부리바다오리',

    '큰뿔부엉이', '큰뿔양', '큰솜털딱다구리', '큰수리부엉이', '큰신천옹',
    '큰아르마딜로', '큰아비', '큰양놀래기', '큰오색딱다구리', '큰유대하늘다람쥐',
    '큰일런드영양', '큰입배스', '큰재갈매기', '큰재개구마리', '큰주홍부전나비',
    '큰채찍뱀', '큰초원뇌조', '큰토끼박쥐', '큰회색머리아비', '큰회색부엉이',
    '큰흰죽지', '키스혼드', '키싱구라미', '키위', '타란튤라',
    '타이거오스카', '타이판독사', '타조', '타카헤', '태양새',
    '태양앵무', '태즈메이니아늑대', '태즈메이니아데빌', '태평양큰도롱뇽', '탱',
    '터키살모사', '턱수염도마뱀', '털귀다람쥐', '털꼬리두더지', '털두꺼비하늘소',
    '털발말똥가리', '털배벌새', '테라핀', '테리어개', '테밍크물떼새',
    '테이라족제비', '테일러캔틸살모사', '텍사스가재', '텍사스거북', '텍사스산호뱀',

    '텍사스영양땅다람쥐', '텐렉', '텐렉과', '토끼', '토끼박쥐',
    '토마토개구리', '토코왕부리', '톰슨가젤', '톱부리왕부리', '투구게',
    '투라코뻐꾸기', '투손줄무늬도마뱀붙이', '투어(鬪魚)', '티모르비단뱀', '티모르왕도마뱀',
    '티베트산양', '틸로사우르스', '파란고리문어', '파란눈썹벌잡이새사촌', '파란점가오리',
    '파란탱', '파랑비늘돔', '파랑새', '파랑새과', '파랑자리돔',
    '파랑쥐치', '파랑지빠귀', '파리', '파리매', '파인바렌스청개구리',
    '파인우드청개구리', '파충류', '파카아구티', '파커거북', '파타스원숭이',
    '팔방산호', '팔색조', '팔색조과(八色鳥科)', '팔팔무늬나비', '팜파스사슴',
    '팥중이', '팬더', '퍼그', '퍼핀', '페가수스',
    '페난티담비', '페넥여우', '페더슨청소새우', '페커리', '페키니즈개',

    '펭귄', '편형동물', '평원두꺼비', '포메라니안', '포사',
    '포스터제비갈매기', '포유동물', '폭군룡', '표범', '표범개구리',
    '표범도마뱀붙이', '표범상어', '푸두사슴', '푸들', '푸른가슴왜가리',
    '푸른관요정벌새', '푸른날개갈매기', '푸른날개마코앵무', '푸른단풍새', '푸른독개구리',
    '푸른동갈양태', '푸른등도롱뇽', '푸른마코앵무', '푸른멧새', '푸른모기잡이',
    '푸른목벌새', '푸른박새', '푸른발부비', '푸른부전나비', '푸른아나콘다',
    '푸른줄망둥어', '푸른풍조', '푸른혀도마뱀', '푸른회색풍금새', '푸에르토리코아놀리',
    '푸에르토리코아마존앵무', '풀머갈매기', '풀색노린재', '풀잠자리', '풍금새',
    '풍산개', '풍조', '퓨마', '프레이리도그', '프렌치엔젤피시',
    '프로메테우스누에나방', '프로방스오이나방', '플라나리아', '플랜틴과일다람쥐', '피그미방울뱀',

    '피그미하마', '피라냐', '피라냐카이만', '피라미', '피셔모란앵무',
    '피조개', '필리핀악어', '핏불테리어개', '하누만랑구르원숭이', '하늘다람쥐',
    '하늘소', '하마', '하와이기러기', '하와이매', '하이랙스',
    '하이에나', '하이티보아', '하테비스트', '하프바다표범', '하피수리',
    '학질모기', '한국의동물들', '한국호랑이', '한우(韓牛)', '할리퀸노린재',
    '할리퀸독개구리', '할미새', '함정거미', '항라머리검독수리', '항아리해면',
    '해리스매', '해마(海馬)', '해면', '해변종다리', '해변톡토기',
    '해삼', '해안우유뱀', '해오라기', '해파리', '향나무노린재',
    '향유고래', '호금조', '호랑나비', '호랑나비과', '호랑이',
    '호박벌', '호반새', '호사비오리', '호아친', '호저',

    '호주거북복어', '호주검은머리따오기', '호주늑대거북', '호주두루미', '호주물개',
    '호주뿔매', '호주실키테리어', '호주씬벵이', '호주악어', '호주초원가면올빼미',
    '호주혹부리오리', '호주황조롱이', '혹고니', '혹등고래', '혹물떼새',
    '혹부리오리', '혼두라스우유뱀', '홍띠하늘소', '홍머리오리', '홍방울새',
    '홍산호', '홍여새', '홍점알락나비', '홍학', '홍학의혀',
    '홍합', '홍합과', '화살게', '화살벌레', '화살오징어',
    '화식조(火食鳥)', '황갈색올빼미', '황갈색유구오리', '황금두꺼비', '황금두더지',
    '황금무당거미', '황금방울새', '황금사자비단원숭이', '황금새', '황금재칼',
    '황로', '황새', '황새류', '황세줄나비', '황소개구리',
    '황소뱀', '황쏘가리', '황알락팔랑나비', '황여새', '황여새류',

    '황오리', '황제기러기', '황제산누에나방', '황제영원', '황제잠자리',
    '황제청소새우', '황제펭귄', '황조롱이', '황조롱이류', '황초록바구미',
    '회색고리왕뱀', '회색꼬리보석벌새', '회색나무개구리', '회색다람쥐', '회색도가머리뻐꾸기',
    '회색돈점박이말', '회색매', '회색머리땅비둘기', '회색머리솔개', '회색머리신천옹',
    '회색머리아비', '회색머리호반새', '회색바다표범', '회색송골매', '회색암초상어',
    '회색앵무', '회색어치', '회색여우', '회색이리', '후투티',
    '후티아', '휘피트개', '휴스턴두꺼비', '흉내지빠귀', '흑고니',
    '흑기러기', '흑돼지', '흑두루미', '흑마(黑馬)', '흑영양',
    '흑조(黑鳥)', '흑표범', '흡혈박쥐', '흰가슴동고비', '흰가슴산달',
    '흰가슴숲제비', '흰가슴지빠귀', '흰갈매기', '흰관앵무', '흰관참새',

    '흰기러기', '흰꼬리매', '흰꼬리멧닭', '흰꼬리물총새', '흰꼬리사슴',
    '흰꼬리솔개', '흰꼬리수리', '흰꼬리영양땅다람쥐', '흰나비', '흰넓적다리붉은쥐',
    '흰눈썹벌새', '흰눈썹울새', '흰눈썹황금새', '흰담비', '흰대양조개',
    '흰돌고래', '흰동가리', '흰등마모트', '흰매', '흰머리독수리',
    '흰머리물떼새', '흰머리수리', '흰머리신천옹', '흰멧새', '흰목걸이독수리',
    '흰목고리뿔호반새', '흰목꼬리감기원숭이', '흰목도리여우원숭이', '흰목벌잡이새', '흰목참새',
    '흰목페커리', '흰물떼새', '흰바다제비', '흰발생쥐', '흰배느시',
    '흰배수리', '흰배지빠귀', '흰부리딱다구리', '흰부리아비', '흰비오리',
    '흰뺨검둥오리', '흰뺨기러기', '흰뺨오리', '흰뺨유구오리', '흰뺨투라코뻐꾸기',
    '흰세점박이박쥐', '흰손티티', '흰수염고래', '흰염소', '흰올빼미',

    '흰이마기러기', '흰이마아마존앵무', '흰점박이도롱뇽', '흰죽지', '흰죽지구안',
    '흰죽지꼬마물떼새', '흰죽지솔잣새', '흰죽지수리', '흰줄검정바리', '흰줄박이오리',
    '흰지느러미암초상어', '흰코거농원숭이', '흰코뿔소', '히드라', '히말라야산양',
    '힐라딱다구리',
  ];

  var btnanimalsdice;
  btnanimalsdice = btnanimals[Math.floor(Math.random() * btnanimals.length)];
  var btnresult = document.getElementById("btnresult");
  var btntext = `오늘의 동물은 <span class="color">${btnanimalsdice}!</span> (${btnanimals.length}개)`;
  btnresult.innerHTML = btntext;
} // 동물

function btnzodiac() {
  var btnzodiac = [
    '거문고자리', '게자리 (황도 12궁 거해궁)', '고래자리', '고물자리', '공기펌프자리',
    '공작자리', '궁수자리 (황도 12궁 인마궁)', '그물자리', '극락조자리', '기린자리',
    '까마귀자리', '나침반자리', '날치자리', '남십자자리', '남쪽물고기자리',
    '남쪽삼각형자리', '남쪽왕관자리', '도마뱀자리', '독수리자리', '돌고래자리',
    '돛자리', '두루미자리', '마차부자리', '망원경자리', '머리털자리',

    '목동자리', '물고기자리 (황도 12궁 쌍어궁)', '물뱀자리', '물병자리 (황도 12궁 보병궁)', '바다뱀자리',
    '방패자리', '백조자리', '뱀자리', '뱀주인자리 (황도 13궁 사견궁)', '봉황자리',
    '북쪽왕관자리', '비둘기자리', '사냥개자리', '사자자리 (황도 12궁 사자궁)', '살쾡이자리',
    '삼각형자리', '세페우스자리', '센타우루스자리', '시계자리', '쌍둥이자리 (황도 12궁 쌍자궁)',
    '안드로메다자리', '양자리 (황도 12궁 백양궁)', '염소자리 (황도 12궁 마갈궁)', '에리다누스자리', '오리온자리',

    '외뿔소자리', '용자리', '용골자리', '육분의자리', '이리자리',
    '인디언자리', '작은개자리', '작은곰자리', '작은사자자리', '작은여우자리',
    '전갈자리 (황도 12궁 천갈궁)', '제단자리', '조각가자리', '조각칼자리', '조랑말자리',
    '직각자자리', '처녀자리 (황도 12궁 처녀궁)', '천칭자리 (황도 12궁 천칭궁)', '카멜레온자리', '카시오페이아자리',
    '컴퍼스자리', '컵자리', '큰개자리', '큰곰자리', '큰부리새자리',

    '테이블산자리', '토끼자리', '파리자리', '팔분의자리', '페가수스자리',
    '페르세우스자리', '현미경자리', '헤라클레스자리', '화가자리', '화로자리',
    '화살자리', '황새치자리', '황소자리 (황도 12궁 금우궁)',
  ];

  var zodiacdice;
  zodiacdice = btnzodiac[Math.floor(Math.random() * btnzodiac.length)];



  if (-1 != zodiacdice.indexOf('황도')) {
    var submessage = `<p style="font-size: 14pt;">당신에게서 <span class="color">특별한 기운</span>이 느껴집니다..!</p>`;
    console.log(-1 == zodiacdice.indexOf('황도'));
  } else {
    var submessage = ``;
  }

  var btnresult = document.getElementById("btnresult");
  var btntext = `
    <p>오늘의 별자리는 <span class="color">${zodiacdice}!</span> (${btnzodiac.length}개)</p>
    ${submessage}
  `;
  btnresult.innerHTML = btntext;
} // 별자리

function btnplayingCard() {
	var card = [
		'스페이드', '하트', '클로버', '다이아몬드', '조커',
		'조커',
	];
	var number = [
		'A(에이스)', '2', '3', '4', '5',
		'6', '7', '8', '9', '10',
		'J(잭)', 'Q(퀸)', 'K(킹)',
	];

	var carddice;
	var numberdice;

	carddice = card[Math.floor(Math.random() * card.length)];

	if (carddice === '조커') {
		var cardselector = `조커`;
	} else {
		numberdice = number[Math.floor(Math.random() * number.length)];
		var cardselector = `${carddice} ${numberdice}`;
	}

	var btnresult = document.getElementById("btnresult");
	var btntext = `오늘의 카드는 <span class="color">${cardselector}!</span> (${((card.length - 2) * number.length) + 2}개)`;
	btnresult.innerHTML = btntext;
} // 플레잉 카드

function btn5playingCard() {
	var card = [
		'스페이드 A(에이스)', '스페이드 2', '스페이드 3', '스페이드 4', '스페이드 5',
		'스페이드 6', '스페이드 7', '스페이드 8', '스페이드 9', '스페이드 10',
		'스페이드 J(잭)', '스페이드 Q(퀸)', '스페이드 K(킹)', '하트 A(에이스)', '하트 2',
		'하트 3', '하트 4', '하트 5', '하트 6', '하트 7',
		'하트 8', '하트 9', '하트 10', '하트 J(잭)', '하트 Q(퀸)',

		'하트 K(킹)', '클로버 A(에이스)', '클로버 2', '클로버 3', '클로버 4',
		'클로버 5', '클로버 6', '클로버 7', '클로버 8', '클로버 9',
		'클로버 10', '클로버 J(잭)', '클로버 Q(퀸)', '클로버 K(킹)', '다이아몬드 A(에이스)',
		'다이아몬드 2', '다이아몬드 3', '다이아몬드 4', '다이아몬드 5', '다이아몬드 6',
		'다이아몬드 7', '다이아몬드 8', '다이아몬드 9', '다이아몬드 10', '다이아몬드 J(잭)',

		'다이아몬드 Q(퀸)', '다이아몬드 K(킹)', '조커', '조커',
	];

	var carddice;
	var box = [];
	var anotherBox = [];

	for (var i = 0; i < 5; i++) {
		carddice = card[Math.floor(Math.random() * card.length)];
		if (anotherBox.includes(carddice)) {
			anotherBox.push(carddice);
			i -= 1;
		} else {
			if (box.includes(carddice)) {
				anotherBox.push(carddice);
				i -= 1;
			} else {
				box.push(carddice);
			}
		}
	}

	var btnresult = document.getElementById("btnresult");
	var btntext = `
		<p>오늘의 카드 5장 (${card.length}개)</p>
		<p style="font-size: 14pt;"><span class="color">${box[0]}!</span></p>
		<p style="font-size: 14pt;"><span class="color">${box[1]}!</span></p>
		<p style="font-size: 14pt;"><span class="color">${box[2]}!</span></p>
		<p style="font-size: 14pt;"><span class="color">${box[3]}!</span></p>
		<p style="font-size: 14pt;"><span class="color">${box[4]}!</span></p>
	`;
	btnresult.innerHTML = btntext;
} // 플레잉 카드 5장

function btnmajorTarot() {
	var direction = [
		'정방향', '역방향',
	];

	var directiondice = direction[Math.floor(Math.random() * direction.length)];
	
	var MajorTarot = [
		'00 The Fool (광대)',
		'01 The Magician (마술사)',
		'02 The High Priestess (여교황)',
		'03 The Empress (여제)',
		'04 The Emperor (황제)',
		'05 The Hierophant (교황)',
		'06 The Lovers (연인)',
		'07 The Chariot (전차)',
		'08 Strength (힘)',
		'09 The Hermit (은둔자)',
		'10 Wheel of Fortune (운명의 수레바퀴)',
		'11 Justice (정의)',
		'12 The Hanged Man (매달린 사람)',
		'13 Death (죽음)',
		'14 Temperance (절제)',
		'15 The Devil (악마)',
		'16 The Tower (탑)',
		'17 The Star (별)',
		'18 The Moon (달)',
		'19 The Sun (태양)',
		'20 Judgement (심판)',
		'21 The World (세계)',
	];
	
	var MajorTarotdice = MajorTarot[Math.floor(Math.random() * MajorTarot.length)];

	var btnresult = document.getElementById("btnresult");
	var btntext = `
		<p>당신의 운명이 보입니다... (${direction.length * MajorTarot.length}개)</p>
		<p style="font-size: 14pt;"><span class="color">(${directiondice})</span></p>
		<p style="font-size: 14pt;"><span class="color">${MajorTarotdice}!</span></p>
	`;
	btnresult.innerHTML = btntext;
} // 메이저 아르카나

function btnminorTarot() {
	var suits = [
		'wands (막대기)', 'chalice (성배)', 'swords (검)', 'coins (동전)'
	];

	var suitsdice = suits[Math.floor(Math.random() * suits.length)];

	var card = [
		'1', '2', '3', '4', '5',
		'6', '7', '8', '9', '10',
		'Page', 'Knight', 'Queen', 'King',
	];

	var carddice = card[Math.floor(Math.random() * card.length)];

	var btnresult = document.getElementById("btnresult");
	var btntext = `
		<p>당신의 운명이 보입니다... (${card.length * suits.length}개)</p>
		<p style="font-size: 14pt;"><span class="color">${suitsdice} - ${carddice}!</span></p>
	`;
	btnresult.innerHTML = btntext;
} // 마이너 아르카나

function btntime() {

	var hourdice = Math.floor(Math.random() * 23);
	var miniutedice = Math.floor(Math.random() * 59);
	var seconddice = Math.floor(Math.random() * 59);

	var btnresult = document.getElementById("btnresult");
	var btntext = `오늘의 시간은 <span class="color">${hourdice}시 ${miniutedice}분 ${seconddice}초!</span> (24시간 기준)`;
	btnresult.innerHTML = btntext;
} // 시간

// ---------- 템플릿 ----------

function word() {
  var word = [];

  var dice;
  dice = word[Math.floor(Math.random() * word.length)];
  var btnresult = document.getElementById("btnresult");
  var btntext = `오늘의 단어는 <span class="color">${dice}!</span> (${word.length}개)`;
  btnresult.innerHTML = btntext;
} // 항목